{"steps":{"1":{"number":1,"title":"What Is My Life Story?","subtitle":"Phase 1 (Meditation)","description":"The 20/20 Life Vision Challenge is a 30 step journey that could, if you let it, transform your life. I am Arman, and I will be your guide. Let’s start with a 5 minute meditation called,‘The Rocking Chair’. Get comfortable, put your phone on silent, turn off the TV, dim the lights and close your eyes. Play some soft music, if it helps you relax.\n\nReady? Now picture yourself in this rocking chair at 90 years old. You are with your grandchildren, reflecting on your life as the sun gracefully sets in the distance. Your grandkids want to know about your life. What will you share with them?\n\nHear the waves softly coming to the shore. Keep your eyes closed and meditate deeply on this question: your life, what has it been? How will you tell this story to the next generation.\n\nNow come back to present day and compare who you are right now, in relation to that 90-year-old man or woman whose eyes you just saw the world through for the last 5 minutes.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/Rknt0PorAIG4uoMQAg4KM/d697d93618b298ce10d1606c7d3f573a/TimeBug-Icons-_Step-1_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"The Rocking Chair","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"5VKB8m3jzyCYkQwwkS6qOQ","type":"Asset","createdAt":"2018-09-13T17:16:26.318Z","updatedAt":"2018-09-13T20:24:26.145Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-1)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/5VKB8m3jzyCYkQwwkS6qOQ/c81d674bcce8aa950c0075233f58807a/TimeBug-Icons-_Day-1_.svg","details":{"size":161518,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-1).svg","contentType":"image/svg+xml"}}},"snippet":"Review your best life memories, regrets and defining moments from the eyes of your future, 90-year-old self. ","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/59WwjOugcwM0MWySgOomwI/960ba78a95e6e8eacf40618c9e6e6e88/20-20-08-Phase-1-Step-1.mp3"},"checkin":{"text":"There's an old Buddhist saying that goes something like - 'One must meditate for one hour everyday. Unless of course you are extremely busy - in that case, meditate for two hours.'A minimum 10 minute Daily meditation is a fundamental part of the 20/20 Life Vision challenge. Did you meditate today?","title":"Daily Meditation","action":{"type":"link","payload":{"link":"journey/rewards?reward=1"}},"message":"Have you meditated today?","frequency":"Daily"},"assignments":[{"icon":null,"content":"What are your best memories? ","order":1},{"icon":null,"content":"What are your main regrets?","order":2},{"icon":null,"content":"What are your defining life moments (e.g., marriage, birth of a child, career awards etc.)? ","order":3},{"icon":null,"content":"What emotions do you feel as you reflect on your life as a 90-year-old?"}],"stepId":"1","workbookDurationMin":15},"2":{"number":2,"title":"What Do I Want To Do More Or Less Of?","subtitle":"Phase 1 (Meditation)","description":"This exercise focuses on a more specific and immediate area: Life Categories, however you define them.\n\nWhat if you could wake up next week and spend your time doing whatever you really wanted to do? Think about your life right now, and what typical weekdays and weekends are like. How would you break down your life, in terms of categories? How much time do you estimate spending on each area in a given week (168 hours)? What specifically would you like to do more of? Less of? Who would you like to spend more time with? Less time with?\n\nCreate your own Life Categories, and use whatever naming conventions you prefer. You will find that we all share certain core activities. Sleep is sleep, work is work, etc. I break down my life activities into 7 main categories and 40 or so sub-areas (i.e., “bugs”) within those 7 categories. I call those sub-areas “bugs,” which is where the concept for Timebug originated. Feel free to use my Life Categories listed below or come up with ones that better fit how you think about and manage your life. There are no restrictions; just make sure that the numbers add up to 168 hours.\n\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/248k2kZa2oAkwEEmkmEYq4/dd339a82aec62352ff3da67f67f76871/TimeBug-Icons-_Step-2_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Things To Do More Or Less Of","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3clG37TYfeKooWwSQUgO0c","type":"Asset","createdAt":"2018-09-13T17:16:01.970Z","updatedAt":"2018-09-13T20:24:01.590Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-2)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3clG37TYfeKooWwSQUgO0c/ba6841390fbd57b8fb9f074ba0d7ae98/TimeBug-Icons-_Day-2_.svg","details":{"size":168398,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-2).svg","contentType":"image/svg+xml"}}},"snippet":"Estimate your current (versus ideal) weekly time allocation across 168 hours (a full week).","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/4Z7BLOgPPOIIacGEs8OSum/b154e3f7c7213f111847d04c52da0a98/20-20-09-Phase-1-Step-2.mp3"},"checkin":{"text":"Now that you've planned up your ideal week, checkin with your weekly time table. Your data is your best friend in the Life Vision Challenge - the numbers don't lie! ","title":"Checkin for step2","action":{"type":"link","payload":{"link":"journey/rewards?reward=2"}},"message":"You have a notification pending for your weekly timetable!","frequency":"Weekly"},"assignments":[{"content":"Break down a typical 168 hour week according to the 7 Pillars Of Life.\n\n\n","order":1,"icon":null},{"icon":null,"content":"How many hours do you ideally want to spend in each activity?\n"},{"icon":null,"content":"What activities do you ideally want to engage in less?\n","order":3},{"icon":null,"content":"What activities do you ideally want to engage in more?\n"}],"stepId":"2","workbookDurationMin":15},"3":{"number":3,"title":"What Are My Strengths & Weaknesses?","subtitle":"Phase 1 (Meditation)","description":"The main goal of this exercise is to determine your best “natural resources” (or strengths) as well as your “road blocks” (or weaknesses). What has been holding you back from reaching your full potential? Our vices can completely disrupt and ruin otherwise happy and fruitful lives. Now isn’t the time to focus only on the positives and brush character flaws under the rug. It is also quite rare to witness people living at their full potential. However, when you come across those who are at or close to that level, you can feel them beaming with energy, and see how happy – and effective – they are. Do you know someone like that? If so, take note for future role modeling exercises.\n\nIn the movie “Lucy,” Morgan Freeman delivers a great lecture about what might happen if human beings start using more than 10% of their brains. I definitely recommend watching it. Freeman notes that humans possess 100 billion neurons but only fifteen percent are activated. He goes on to say that “there are more connections in the human body than there are stars in the galaxy.” Accordingly, “we possess a gigantic network of information to which we have almost no access.”\n\nCan you be objective about your own strengths and weaknesses? Objectivity is one of the cornerstones of wisdom and maturity and it is one of the most difficult qualities to possess. It requires us to see ourselves clearly; without bias and judgment – not an easy task. Ask yourself what kind of impression you make on people (not just the first impression, but over time). See yourself through the eyes of others who know you well enough to understand your life path so far.\n\nHave the courage to be honest about yourself but don’t beat yourself up in the\nprocess. The concept of “brutal honesty” is just an excuse to be mean to people and put them down to make others feel better. So be gentle.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/sBuUpy8r7wqkmuqQEoQKm/4abfc2138a99cc4e624c947ebb55a8a1/TimeBug-Icons-_Step-3_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Resources and Roadblocks","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"68a76MNDUIsIOicWGcA8I4","type":"Asset","createdAt":"2018-09-13T17:16:21.523Z","updatedAt":"2018-09-13T20:24:17.322Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-3)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/68a76MNDUIsIOicWGcA8I4/826e4457f7c80bc68d666a922828cf4b/TimeBug-Icons-_Day-3_.svg","details":{"size":172132,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-3).svg","contentType":"image/svg+xml"}}},"snippet":"Think about your Strengths & Weaknesses and tie them to specific goals attained or not.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/3JceevRDBmqwWwMaKyUkya/5a949f1d5b14e1e95127946c412394d5/20-20-10-Phase-1-Step-3.mp3"},"assignments":[{"icon":null,"content":"What are your strengths?"},{"icon":null,"content":"What are your weaknesses?"},{"icon":null,"content":"What does a close friend or family member, an objective one, think of your strengths and weaknesses?\n\n\n"}],"stepId":"3","workbookDurationMin":15},"4":{"number":4,"title":"Who Is My Supporting Cast?","subtitle":"Phase 1: Meditation","description":"This exercise begins the process of forming a Board of Advisors, either formally or informally – the CEO of Me concept. It is important to go beyond yourself and your ideas, and bring in others who know you well and are actively part of your life. Feedback and encouragement as we move along our life path are crucial.\n\nYou can learn a lot about yourself based on who you rely on and spend most of your time with. I’ve observed that many people do not have an effective and nurturing supporting cast. We go with the easy road, surrounding ourselves with familiar faces. Some are lucky enough to have at least one strong role model – maybe a parent or a friend who collaborates with us on life’s trials and offers guidance.\n\nWith a little bit of effort, we can find new people or revive old relationships that\nare positive. Who are you comfortable talking to about your goals and deepest\ndesires?\n\nYour challenge is to envision the ideal Board of Advisors for your life, a group that gives you the best chance of fulfilling your 20/20 Vision.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4fPhMJtkQ0oWQs0iUQS0ym/06886c2ae71ee22ddc6637e8adabfa44/TimeBug-Icons-_Step-4_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Supporting Cast","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"7jJU7WfFG8UaYoG8suM0my","type":"Asset","createdAt":"2018-09-13T17:16:08.941Z","updatedAt":"2018-09-13T20:24:08.575Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-4)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/7jJU7WfFG8UaYoG8suM0my/4863ccd5119de3259d3c98bdc6c55378/TimeBug-Icons-_Day-4_.svg","details":{"size":176227,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-4).svg","contentType":"image/svg+xml"}}},"snippet":"Comprise your supporting cast, the people who help you in various aspects of your life.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/jcRz4J6CfCGE0swiUi0gc/68ea86e3bdc2a3bed8120e0704053b9a/20-20-12-Phase-1-Step-4.mp3"},"assignments":[{"icon":null,"content":"Who is on your Board of Advisors?"},{"icon":null,"content":"List any current or potential support groups and meetups, formal or informal, that are a source of positive energy for you, in one or more domains of life.\n"}],"stepId":"4","workbookDurationMin":15},"5":{"number":5,"title":"What is My Approach to Life Goals? The 7 Goal Types","subtitle":"Welcome to Day 5 of the 20/20 Life Vision Challenge! Life Goals","description":"What kind of attitude and approach do you have towards goal setting and life goals? Do you not think about and merely try to make it through the day, taking things as they come? Or are you a go-getter or a task master? After looking back at my goals over the years, I recognized the need for more classification, as there are vastly different types of goals.\n\nSome goals are very specific and tangible, while others are based more on feelings and dynamics between people.\n\nI broke down my Goals into 7 Types to gain clarity on what exactly I wanted to\nachieve. Read through them below and think about which ones are most relevant to you. \n\nTake a look:\n\n__1. Energy & Time (ET) Type__ – ET implies the process of setting and tracking\ngoals through the filters of how you allocate time and energy. “I will go to\nthe gym every day for an hour.”\n__2. Achievements & Skills (AS) Type__ – Generally, bucket list tasks and experiences that you would like to accomplish go in here. “I want to speak Spanish fluently” or “I want to run a marathon.”\n__3. Health Indicators (HI) Type__ – Objectives related to bodily health. “I want to\nlive and be healthy until 100” or “I want to quit smoking.”\n__4. Internal Qualities (IQ) Type__ – Objectives related to personality growth or\nmotivation. Self-assessments can help identify attributes to work on. “I want\nto be more confident.”\n__5. Place & Environment (PE) Type__ – Objectives related to our day-to-day\nenvironments, including home, workplace, commuting and travel. “I want to\ntake more vacations this year.” or “I want to work from home more to avoid\ncommuting and have a more relaxed atmosphere.”\n__6. Material Outcomes (MO) Type__ – Ambitions related to money and possessions. “I want to have $1 million dollars.” “I want to buy a luxury car this\nyear.”\n__7. Relationship Quality (RQ) Type__ – Aims related to personal relations. “I want\nto have a better relationship with my father.” or “I want to be regarded as a\nwell-liked colleague at my company.”\n\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3yIAo9TD4IE06mwUcYg8ku/d9db7d6def32dd6fdb21f6f52f674b6f/TimeBug-Icons-_Day-5_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"The 7 Goal Types","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"5C61qDha3S0uw8oS0Ke8ik","type":"Asset","createdAt":"2018-09-13T17:14:20.743Z","updatedAt":"2018-09-13T20:21:59.768Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Step-5)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/5C61qDha3S0uw8oS0Ke8ik/ac38c8f1baf8e53870b49f89e5fd2792/TimeBug-Icons-_Step-5_.svg","details":{"size":9856,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Step-5).svg","contentType":"image/svg+xml"}}},"snippet":"What kind of attitude and approach do you have towards goal-setting and life goals? Do you not think about it much, just trying to make it through the days, or taking things as they come? Or are you a go getter and a task master?","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/387A7bSjqMmYwkuGaY8sqg/708caa66cc4aaa3e1709f351afddac44/20-20-14-Phase-1-Step-5.mp3"},"checkin":{"text":"Use the 20/20 goal tracking system to keep track of your progress and update your plans.","title":"Goal Tracking","action":{"type":"link","payload":{"link":"journey/rewards?reward=5"}},"message":"It's time to check in with your goals. Use Life Vision to track your progress.","frequency":"Weekly"},"assignments":[{"content":"What are some of your recent goals? Classify them according to the 7 Goal Types.","icon":null}],"stepId":"5","workbookDurationMin":15},"6":{"number":6,"title":"What Are the Goals of Others Around Me?","subtitle":"Phase 1: Meditation","description":"Step outside of your own aspirations for a few moments, and genuinely direct your energy towards those around you, be it family, friends or colleagues at work or school.\n\nImagine that you have received feedback from your Board of Advisors. Now it’s your turn to give, and possibly sit on some Boards for other CEO of Me’s. What are their goals and dreams, and how can you play a small or large part in supporting them? In 2012, I wrote a blog titled “How the Successes and Failures of Others Impact You” – it’s a quick read, take a look – [Blog Post](https://timebug.org/2012/11/how-the-successes-and-failures-of-others-impact-you \"Blog Post\")”\n\nWhile I am a big believer in individuality and self-determination, the big picture places into perspective the reality that we are all connected and impact each other in very direct and also incredibly subtle ways.\n\nThis lesson is a call to action for you to open your mind and heart to this truth, and then commit to it as a priority in your 20/20 Life Vision. I am sure that you are already doing things to help the goals of others and to help other people. Some of us are guilty of doing “too much” for others at the expense of our own needs – which is the other end of the pendulum from selfishness, and equally unsustainable.\n\nThere must be balance in the way you work for your goals versus the goals of\nothers. Wherever you can find ways to share common goals with others, be it at work or with your family, incredible opportunities for power, human connection and collective achievement exist (e.g., think about a sports team winning a championship, the experiences they shared, and the life long bonds created as a result).","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/44on2DfaXm0m8AAs6MqE8I/0b37f79ed82af8f55e2ca625b855deb2/TimeBug-Icons-_Step-6_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"The Goals of Others","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"71D94tAC0EG6sIWg8uOokk","type":"Asset","createdAt":"2018-09-13T17:15:55.617Z","updatedAt":"2018-09-13T20:23:57.196Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-6)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/71D94tAC0EG6sIWg8uOokk/a28a2866a1ef918b41c296e482a78c97/TimeBug-Icons-_Day-6_.svg","details":{"size":186583,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-6).svg","contentType":"image/svg+xml"}}},"snippet":"Climb outside of your own box and consider the goals of others around you.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/7KQO3BROOkcoUeke4WQ6QM/6ad9106d8c83d82fb9939ffb9b0d4a38/20-20-16-Phase-1-Step-6.mp3"},"checkin":{"text":"It takes a village. Don't be afraid to ask for help, and make sure you commit to helping those around you achieving the goals you laid out in step 6.","action":{"type":"link","payload":{"link":"journey/rewards?reward=5"}},"message":"Time to check in with the goals you commited to helping others with.","frequency":"Monthly"},"assignments":[{"icon":null,"content":"Who do you really care about (up to 3 people)?\n"},{"icon":null,"content":"What are their goals (up to 5)? If you aren't sure, ask them."},{"icon":null,"content":"How do you plan to support them? How much time do you estimate it will require in the coming year?\n"}],"stepId":"6","workbookDurationMin":15},"7":{"number":7,"title":"What Happens After I Set Goals?","subtitle":"Welcome to Day 7 of the 20/20 Life Vision Challenge!","description":"If you made it this far, I am impressed – you are about 25% of the way there. This exercise focuses on what usually happens to you after you set goals. Sit down, clear your mind, read this with focus, and answer the questions with clarity. Consider doing this with every exercise.\n\nDoesn’t Goal Setting make you feel inspired and energized? When you set goals, you are right in the moment of vision. This is the fun and limitless part where you can think freely. What typically happens after you set goals however, does not always transpire as planned.\n\nCheck out the 7 most Common Goal Outcomes (CGOs) on the next page.\n\n## __The 7 Common Goal Outcomes__\n\n\n__1. Bench Warmer__ – The goal sits on the shelf (or the bench) collecting dust. You avoid it or procrastinate it in any way possible.\n\n__2. Fast Starter__ – The goal gets out of the gate quickly and enthusiastically, only to be forgotten because life got in the way. Your drive (towards the goal) declines over time, until finally it fizzles out.\n\n__3. Breeze Through__ – “Crushed it!” Not only do you achieve the goal, but you blow it out of the water. It didn’t even require significant effort. Just a moment. Was this a setup for an easy victory? If so, is there anything wrong with that?\n\n__4. (Self?) Sabotage__ – Everything is great, and you’re right on track to get it done. You want to win the race, and you’re winning by a mile. Then, at the last minute, all of a sudden, something happens, and you abort the mission. A more important priority came up – either an exciting new opportunity or maybe just a new distraction. Somehow, you lost total motivation in an instant, whether or not the sabotage was self-imposed or brought about by an external situation.\n\n__5. NFLOE (Not For Lack Of Effort)__ – You hustle, contribute significant energy, and fight all the way to the finish. While the effort is there, the results do not come through. It just wasn’t enough. You underestimated what it takes to achieve this goal. Use this as a lesson to inform your future goal setting.\n\n__6. Right On Point__ – You made a plan, followed through, and nailed it!\n\n__7. Latency Effect__ – The goal deadline expires, you note either a “success” or “failure” and then suddenly, the outcome changes. That promotion that you worked so hard for comes through! Conversely, your great achievement falls apart. Pay attention to these latent outcomes. It can be very positive for future goal-setting exercises. It might take longer than you think to receive a desired (or undesired) outcome.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/6hCpN8tXsQUaKm60oUaMgc/21aabc1a234f503de9d462650f4a807b/TimeBug-Icons-_Day-7_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"What Happens After We Set Goals?","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6hCpN8tXsQUaKm60oUaMgc","type":"Asset","createdAt":"2018-09-13T17:14:57.525Z","updatedAt":"2018-09-13T20:22:49.391Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-7)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6hCpN8tXsQUaKm60oUaMgc/21aabc1a234f503de9d462650f4a807b/TimeBug-Icons-_Day-7_.svg","details":{"size":190872,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-7).svg","contentType":"image/svg+xml"}}},"snippet":"Today’s meditation is a reflection on what usually happens to us after we set goals.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/6m5lxxfFSwwE0i0kgQmEAm/89f7c63430257a128c6ae75ee8b1f4b6/20-20-17-Phase-1-Step-7.mp3"},"assignments":[{"icon":null,"content":"What are 5 of your goals from the past 5 years?"},{"icon":null,"content":"Classify them according to the 7 Common Goal Outcomes listed below."},{"icon":null,"content":"Have you noticed any patterns? Have any guesses as to the reasons underlying such patterns?\n"}],"stepId":"7","workbookDurationMin":15},"8":{"number":8,"title":"What is My Internal Energy Production?","subtitle":"Phase 1: Meditation","description":"This lesson focuses on taking stock of your own energy levels at different times of the day and week, and then mapping these levels to your daily routines for what I call “Internal Energy Production.” It sounds more like a business term, but it is more relevant to the quality of our lives. Most people simply don’t have enough fuel to effectively pursue their goals and manage their core responsibilities. Even if they do, they are depleted at the end of each day, and enter couch potato mode after getting home from work.\n\nHow often have you thought of or heard others say, “I don’t have the energy to workout” or “I’m too tired after work”? The irony is that, although it takes an amount of energy to exercise, what one gets back from that experience is generally a multiple of what was invested.\n\nThere are other sources of Energy Production, such as food, which I’ll discuss in later Steps. External sources of energy are a vitally important part of our life equation. However, the advantage of internal sources is that we don’t necessarily need much from outside of ourselves to create the resulting energy.\n\n## Internal Energy Sources\n\n__1. Physical Exercise__ – This is a concrete, known entity, with all kinds of scientific and personal evidence, that confirms how important it is to our moods and productivity. While most agree on those benefits, it is typically motivation, prioritization or discipline factors that disrupt our best laid plans of integrating exercise into our lives.\n\n__2. Meditation__ – By meditation, I’m not talking about “meditating on ideas” but the act of using our breath and body to relax, clear the mind and go deeper into our inner worlds. There are so many types and methods of meditation. I will outline and recommend several practices over the coming exercises. Some people use music, lighting and/or aromas (e.g., incense, candles) to set the mood, while others use nature (outdoors). Prayer, depending on how it is done, is a powerful form of meditation. Everyone has to find what works for them. The question is whether you make time for meditation in your current schedule, and whether or not you comprehend the connection between this practice and the quality of your health and life.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/6GkLb3xdtKK0WwQEygoeWO/91c0c75472e2ec10a68b6297a83370b5/TimeBug-Icons-_Step-8_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Internal Energy","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3GhCRaU73iiMIg2UuQgI4s","type":"Asset","createdAt":"2018-09-13T17:14:55.908Z","updatedAt":"2018-09-13T20:22:48.422Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-8)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3GhCRaU73iiMIg2UuQgI4s/bfdbd60f23863701249d3f511bb9c386/TimeBug-Icons-_Day-8_.svg","details":{"size":193053,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-8).svg","contentType":"image/svg+xml"}}},"snippet":"Think about how you produce energy through exercise, meditation etc.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/1KsYCYGg20mWSYomu2QK4A/0974e76bc0da6d0c9d91263faa221dc2/20-20-19-Phase-1-Step-8.mp3"},"checkin":{"text":"How often have you thought of or heard others say, “I don’t have the energy to workout. I’m too tired after work.”? Remember, what one gets back from that experience is generally a multiple of what was invested.","title":"Daily exercise","action":{"type":"link","payload":{"link":"journey/rewards?reward=8"}},"message":"Did you exercise today?","frequency":"Monthly"},"assignments":[{"icon":null,"content":"What are your different energy levels (physical, mental and emotional) at different times of a typical day (morning, afternoon, evening)? "},{"icon":null,"content":"(a) How many times do you exercise per week? (b) For how long? (c) What type? (d) Alone or with others? (e) What time of day?\n"},{"icon":null,"content":"(a) How many times do you meditate per week? (b) For how long? (c) What type ? (d) Alone or with others? (e) What time of day?\n"},{"icon":null,"content":"Exercise and meditate daily from here on out through the rest of the 20/20 Life Vision Challenge, for at least 20 minutes combined. Are you committed to this?"}],"stepId":"8","workbookDurationMin":15},"9":{"number":9,"title":"Who Are My Role Models?","subtitle":"Phase 1: Meditation","description":"During __Step 4__, I introduced the concept of being the CEO of Me and building a Board of Advisors, a supporting, positive cast of friends, family, colleagues and mentors.\n\nWho do you consider to be your role models? Hopefully, you have some direct contact with at least one or several people who you really look up to, and seek in some ways to emulate.\n\nI recommend identifying or finding at least one role model from your contacts, and then at least one who presents an ideal that you do not personally know (e.g., maybe someone in your trade that achieved success). Whose life looks good to you, not just in terms of what they may have materially, but in termsof their inner content, quality of their relationships and their aura – the energythat they give off? Our role models often change as we evolve, moving through different phases of our lives. Therefore, it is OK to “retire” role models, in favor of new ones.\n\n## Consider Role Models, Idols or Archetypes.\n\n__Role models__ can be either those who you do or don’t know personally, unlike mentors who you’re in close contact with.\n\n__Idols__ can be movie stars, athletes and celebrities, for various reasons, not all of which are long lasting or necessarily beneficial. Our (Western) society certainly puts a lot of unrealistic and fantastical ideas in our minds through advertising and other unconscious forms of hero worship. Hopefully, as we grow older, we create more separation between fantasy and reality. \n\n__Archetypes__ are role models who are not necessarily who we think they are – after all, how do we really know who someone is from a magazine or TV program?","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/5CLDBAzoDSsKsKQqo6kEQo/0a4aeaf341b2ca6ee8b41a3c9aab51a0/TimeBug-Icons-_Step-9_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Role Models","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"1rC4VYHVuYqu8IE8uGegCm","type":"Asset","createdAt":"2018-09-13T17:14:54.323Z","updatedAt":"2018-09-13T20:22:45.999Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-9)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/1rC4VYHVuYqu8IE8uGegCm/ebd6619c2f3b107b5c3168fde12b36aa/TimeBug-Icons-_Day-9_.svg","details":{"size":202408,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-9).svg","contentType":"image/svg+xml"}}},"snippet":"Think about your role models, those who you aspire to be like and can learn from.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/3RAxOhU7LGKOCYcqOcCoqa/98dbf4025d95b7b9b7f07b94f9744b05/20-20-21-Phase-1-Step-9.mp3"},"checkin":{"text":"Role Models.","title":"Role Models","action":{"type":"link","payload":{"link":"journey/rewards?reward=9"}},"message":"We choose our role models because they inspire us. Why not check in with yours and get a dose of inspiration in your day?","frequency":"Daily"},"assignments":[{"content":"Who are your current role models?\n\n","icon":null},{"icon":null,"content":"What Life Category does he/she primarily influence?"},{"icon":null,"content":"To what degree do you know and interact with each Advisor personally? "},{"icon":null,"content":"Why do you look up to each Advisor? What do you want to learn from them?\n"}],"stepId":"9","workbookDurationMin":15},"10":{"number":10,"title":"Mapping Out My Internal World","subtitle":"Welcome to Day 10 of the 20/20 Life Vision Challenge!","description":"Back in __Step 8__, I prescribed two important daily practices – Exercise and Meditation – for building positive energy, and discovering / clarifying your vision. Are you keeping up with it? Is there part of you that had a reaction to that prescription, setting off internal voices like “I don’t have time for that,” “I’m too busy,” “He doesn’t understand my life’s challenges,” “What does he know anyway?”\n\nDon’t worry, I’ve heard it all before – inside my own head! How can you become more aware of these voices, some of which are so subtle yet influential, that you don’t even hear them? You just act upon their suggestions.\n\nIn order to develop and attain any type of meaningful life vision, it is imperative to “Know Thyself” as intimately as possible, or should I say, “Know Thyselves?” Just like any community or family has multiple personalities and voices that oftentimes want different things, each of us has different aspects of ego-personality within – let’s call those different “I’s,” as in “Greedy I,” “Generous I,” “Lazy I,” “Motivated I,” “Obsessive I,” “Calm I,” etc. How well coordinated and integrated these different I’s are, to a large extent, determines how much energy you have, how successful you are in your endeavors, and how good you feel overall.\n\nYou literally have to develop internal leadership skills and claim your rightful place as the CEO of Me, with the understanding that your internal company called “Me” actually consists of hundreds of different “I’s” that all want to be the boss without accountability.\n\nThink about your internal world like it is that company or even a country called “Me.” Come up with a name. In __Step 3__, you created a list of Strengths & Weaknesses. Reflect on that list. How are your strengths and weaknesses manifesting through your I’s?\n\n## Consider this Scenario...\n\nOn the day of a big presentation at work or school that you worked so hard to prepare for, one of your I’s decides to throw a tantrum, gets really nervous or oversleeps, throwing off your flow. This is where self-sabotage comes from (remember, Common Goal Outcome #4, Self-Sabotage).\n\nCan you think of any other scenarios? I’m sure that you can come up with plenty of examples, both positive and negative, that reflect your internal order orchaos.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/Y5r1nDqh0Y02GKCeUekMC/93ad67b978dac22dc96a9b6011ca0626/TimeBug-Icons-_Day-10_.svg"},"type":"MEDITATION","color":"#005587","duration":30,"stepScreenDescription":"Mapping Out Your Internal World","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"Y5r1nDqh0Y02GKCeUekMC","type":"Asset","createdAt":"2018-09-13T17:14:53.264Z","updatedAt":"2018-09-13T20:22:43.801Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-10)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/Y5r1nDqh0Y02GKCeUekMC/93ad67b978dac22dc96a9b6011ca0626/TimeBug-Icons-_Day-10_.svg","details":{"size":213939,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-10).svg","contentType":"image/svg+xml"}}},"snippet":"Each of us has a diverse internal world, rich with varying emotions, thoughts and behavior patterns. While we do change over time, many of our patterns are sticky and continue manifesting over time, possibly taking slightly different new forms.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/1ep9Ef7bIm2UGaaEG4I6Ak/46a6aa2d0f869035ebea8ab8214becce/20-20-23-Phase-1-Step-10.mp3"},"assignments":[{"icon":null,"content":"Today, we wrap up Phase 1 of 3 10-day phases; tomorrow, we will recap what we learned (about ourselves) in Phase 1, and then move onto the Self-Assessment Phase, with an honest look back at who we have been and what we have achieved over the past 5 years.\nBack on Day 8, I prescribed two important daily practices – Exercise and Meditation – for building up positive energy, that can help you discover and clarify your vision. Are you Before going into the worksheet, take 5-10 minutes to meditate as deeply as possible. Get into a comfortable position, in a private space, with your cell phone (and other potential distractions) off; light a candle and/or some incense, dim the lights and close your eyes. Focus on your breathing – deep and slow breathing, into your solar plexus, holding your breathe for just a second or two longer than usual before each release. Let go of any thoughts if and when they come up, continuing to bring attention back to the inflow and outflow of your breath. This is an example of the type of meditation that you can do daily, before any major project or assignment, as it brings clarity and grounding to your heart and mind. \n"},{"icon":null,"content":"What are 5-15 different Is that you feel are a part of yourself? (e.g., “Lazy I” could resemble “Procrastinating I”)"},{"icon":null,"content":"How strong is each I (1 = Weakest and 10 = Strongest)?"},{"icon":null,"content":"What would this \"I\" say in a few words (e.g., Angry I – \"LEAVE ME ALONE!! STOP BOTHERING ME!”)?"},{"icon":null,"content":"How have each \"I\" either hindered, aided or done nothing to your goals?\n"}],"stepId":"10","workbookDurationMin":15},"11":{"number":11,"title":"My 5-Year Life Report","subtitle":"Phase 2: Assessment ","description":"This exercise marks the beginning of Phase 2, the Assessment Phase, during which you look back on the most recent period of your life to objectively review what was achieved, what you struggled with and what your current status is as a result.\n\nI have been doing very detailed goal-setting and annual planning since I was 19 years old. These have been some of the most challenging and rewarding activities that I have taken on in my now 40+ year lifetime. It is very difficult to look into the future and lay out long-term plans amidst what seems like a very unpredictable world. My own goals and aspirations have often been very far off from the reality that came to be – but not all of them. I have also tasted the fruits of achievements that I know would not have been possible without a strong vision, intention and commitment directed towards those aims. \n\nOver 20 years of goal-setting, annual reviews and new year iterations, I’ve learned how to be more realistic about what it takes to progress towards my goals, and recognized what skills I needed to acquire in order to be more productive along the way, all without compromising the grandiosity of my aspirations. I still shoot for the stars, and so can you.\n\nSo over the course of Phase 2, I will ask you to honestly assess all the important areas of your life and character, from Health and Relationships to Finances. This is a comprehensive program, and I know that it is not easy to look at yourself in the mirror from all of these different angles, but it is necessary if you want to have a rich and satisfying experience while productively marching forth towards your dreams. The journey is just as, if not more, important than the destination.\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3Ql7oWQOM0aaeqUMIywmwc/4cb5639715e5d892689a63087b2bb93f/TimeBug-Icons-_Step-11_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"The 5-Year Life Report","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3u068ZzmC4cEW6w4aEckyM","type":"Asset","createdAt":"2018-09-13T17:14:52.710Z","updatedAt":"2018-09-13T20:22:43.001Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-11)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3u068ZzmC4cEW6w4aEckyM/71c9210d354f1660864ed9c0bcc9c29e/TimeBug-Icons-_Day-11_.svg","details":{"size":219045,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-11).svg","contentType":"image/svg+xml"}}},"snippet":"Review your goals, goal outcomes and satisfaction with each from over the past 5 years.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/4QJzYxoYmASsC0QMKuekk0/4bee5990f8ace180f92467b66da00f03/20-20-27-Phase-2-Step-11.mp3"},"assignments":[{"icon":null,"content":"What were your top goals over the past 5 years?"},{"content":"How far did you get with each goal (as a percentage)?","icon":null},{"content":"How satisfied are you with the effort (time & energy) you committed to each goal and the corresponding goal outcome?\n\n","icon":null},{"content":"How would you describe your goal-process? [Check off one: A) I haven’t done anything; B) Ad hoc and random; C) Good at setting but not tracking; D) Super detailed and consistent; E) Thorough + working with a coach or peer group]\n","icon":null},{"content":"What years did you track your goals? [Check off each year that you have done this for – Year 1, year 2, Year 3, Year 4, Year 5]","icon":null},{"icon":null,"content":"What main emotions have you felt over the past 5 years?\n"}],"stepId":"11","workbookDurationMin":15},"12":{"number":12,"title":"What are My Major Life Events (MLEs) & Defining Moments (DMs)?","subtitle":"Phase 2: Assessment","description":"__Step 11__ was a big assignment, and this lesson might add a few more new wrinkles in your thinking. I challenge you to contemplate what your Major Life Events (MLEs) and Defining Moments have been for you over the past 5 years. \n\nMLEs specify what happened at the time, whereas Defining Moments determine how you processed the event – what was your internal and external response? \n\nHow did these MLEs, or even non-major events move you to reconsider your approach to an area of life? Nothing actually has to happen externally to prompt an inner change of perspective. When MLEs occur, it also typicallyshifts your Energy & Time allocation (__Step 5__, ET Goal Type, remember?) dramatically (e.g., I had my first child – a son – in 2015, and had to make some major scheduling and planning shifts to make time for him and I to bond!).\n\n## Some MLEs and DMs to Consider:\n\nBy no means is this a full list, and ultimately, what constitutes an MLE for you is somewhat subjective:\n\n1. Getting Married or into a new Romantic Relationship;\n2. Getting Divorced or out of a new Relationship;\n3. Having a child;\n4. Graduating from School;\n5. Dropping out of School;\n6. Starting a New Job;\n7. Getting Fired from a Job;\n8. Quitting a Job;\n9. Moving (to a new Home, City or Country);\n10. Getting injured or having a major surgery;\n11. Losing someone you care for;\n12. Starting a Company;\n13. Selling a Company;\n14. Winning the Lottery;\n15. Quitting Drinking or Smoking;\n16. Running a Marathon;\n17. Taking a major journey (i.e. 6-month trip around the world);\n18. Other major lifestyle change;\n19. Converting to/from a specific Religion;\n20. Being Honored in Some Way (i.e. Team MVP, Employee of the Month, etc.).","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3FbIxQQre0sqaCS6o0aOgE/d0365e9dce0c4b7dc73afd771a3345dc/TimeBug-Icons-_Step-12_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Major Life Events","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3PvYDC2LXG2SUU8SS2Mmyw","type":"Asset","createdAt":"2018-09-13T17:14:50.908Z","updatedAt":"2018-09-13T20:22:40.934Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-12)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3PvYDC2LXG2SUU8SS2Mmyw/49cb214762fc68f99384dc371cfe2a16/TimeBug-Icons-_Day-12_.svg","details":{"size":227131,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-12).svg","contentType":"image/svg+xml"}}},"snippet":"Contemplate what your Major Life Events (MLEs) and defining moments were over the past 5 years.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/jgYOc8D91QEescUA4IyGM/5868bbb82d964625964bbb73dbc2e227/20-20-29-Phase-2-Step-12.mp3"},"assignments":[{"icon":null,"content":"What MLEs happened to you over the past 5 years?\n"},{"icon":null,"content":"How did those MLEs factor in – positively and negatively – to your goals over the past 5 years?\n\n"},{"content":"Did these MLEs increase, decrease or do nothing to your Internal Energy Production?","icon":null}],"stepId":"12","workbookDurationMin":15},"13":{"number":13,"title":"Career ... Am I Doing What I Love?","subtitle":"Phase 2: Assessment","description":"Over the next 7 steps, I will ask you to assess the last five years of your life, across different core areas, which I call the 7 Pillars of Life.\n\nLife Pillars are different than Life Categories (introduced back in __Step 2__) in that Categories signify how you classify and spend your time; whereas Pillars, although considering our time investment as well, are more focused on Quality indicators, like purpose and intention. Pillars are immutable foundations of Life, that we have to engage one way or another, while Categories can be sliced and diced in different ways, and also change for each of us over time.\n\nReflecting on __Step 4__ (Supporting Cast) and __Step 9__ (Role Models), prepare to reach out to your cast this week for feedback. Ideally, you would have at least one person, a mentor or peer, to check-in with for each of the 7 Pillars (see next page) starting with today’s focus: your Career.\n\nWhen it comes to career aspirations, to what degree are you doing what you love? Most people (90%) typically respond, “I am not sure what I love to do when it comes to work.” “That’s not realistic. I work to make money.” Or “Kind of. I wanted to pursue this track, and I’m doing it. I’m sorta happy with it.” What do the other 10% – the ones who are living their dreams – know that the 90% does not? I believe they are purpose-driven people who have a firm belief that every individual is endowed with certain gifts and skills for a reason and a fulfilling work life depends on whether you devote your energy to finding and pursuing that purpose. If you are in the 90% or unsure, that is understandable, and you can still find a modicum of satisfaction and be successful from there. Maybe your career is not the area of your life from which you look to draw energy and inspiration.\n\nBut if work is important to you, and you are not feeling satisfied, then a big percentage of your life force is being misdirected every week, and that impacts all other areas of your life.\n\n## The 7 Pillars of Life:\n1. Career\n2. Finances\n3. Aims & Hobbies\n4. Health\n5. Relationships\n6. Environment\n7. Spirituality\n\n\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/Til9aUeuYK8OqmioW6qku/e006d60532dc90b93226eef3b16289e7/TimeBug-Icons-_Step-13_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Career","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"w0BubGHAXYaU2gqEsGeQS","type":"Asset","createdAt":"2018-09-13T17:14:47.432Z","updatedAt":"2018-09-13T20:22:37.522Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-13)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/w0BubGHAXYaU2gqEsGeQS/2b74f11206e7d646b3d387d5e796cde7/TimeBug-Icons-_Day-13_.svg","details":{"size":238543,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-13).svg","contentType":"image/svg+xml"}}},"snippet":"Think about your career goals and performance over the past 5 years. ","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/65baf3DX1u6a406myC0WwU/94bd78ff91381471ded7bc08bfb26ee7/20-20-31-Phase-2-Step-13.mp3"},"assignments":[{"icon":null,"content":"- Has your salary grown (or not) in the past 5 years? [Yes or No]"},{"content":" Are you paid fairly for what you offer? [1) Yes 2) No or 3) I'm not sure]","icon":null},{"icon":null,"content":"How much do you love or hate work? (1= Hate it and 10= Love it)"},{"icon":null,"content":"- What does my boss or a peer say about my work performance?\n- What do you say, now for myself – what were my shortcomings at work over these 5 years?\n- Did you pay a price for your self-recognized or boss/ colleague-perceived weaknesses over the past 5 years?"},{"content":"Did you meet whatever compensation goals you set for yourself over the past 5 years?","icon":null},{"content":"How many hours do you work, on average, per week?","icon":null},{"content":"Do you work more or less hours since Year 1? ","icon":null},{"content":"What is your motivation level at work right now? (1=Not Motivated and 10=Highly Motivated)","icon":null},{"content":"What were some of the meaningful achievements you have had at work over the past 5 years?","icon":null},{"content":"What changed, if anything, at work as a result of these achievementa (e.g., you got a raise)? ","icon":null}],"stepId":"13","workbookDurationMin":15},"14":{"number":14,"title":"Finances ... Is My House In Order?","subtitle":"Phase 2: Assessment","description":"When it comes to Personal Finances, who is on your Board of Advisors? Reach out to these individuals this week, if you can, in order to get some diverse feedback and perspectives. Your relationship with money is closely related to your career. What you do with your money takes on a life of its own. As a case in point, you can have two people, at the same age, in the same job, with the same salary, but they may have entirely different saving and spending habits, setting up a life with perpetual debt or a comfortable nest egg. Let’s take a deeper look.\n\nWhen are you supposed to learn how to manage your money? This isn’t taught in school. We end up graduating college typically at 22 years old or go straight to work at 18 years old, and get thrown into the fire with expenses to manage and a paycheck for the first time. So you learn as you go, on the spot, generally without much guidance. Your parents are only as helpful in this regard as the sensible money lessons they demonstrated to you as a kid.\n\nGiven the powers of Capitalism that essentially run our society – especially in the West – materialism is rampant. Unfortunately, we have come to value things and money more so than internal content – what one of my role models, Dario Salas, calls Cosmic Currency. However, that does not mean that money “is bad” or that we should not strive to attain it; on the contrary, it is a necessary instrument, that ought to reflect the fruits of our hard work and responsible decision-making in managing our resources. We need to cultivate positive, realistic and balanced views on money, so that we can utilize this form of energy effectively, as a means (not an end) towards achieving our life’s purpose.\n\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4mn5cGCWOcWKyaEKEmgwUe/56791edfd1df731bffe820bb74a7a705/TimeBug-Icons-_Step-14_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Finances","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6o5JGs7SuW2yWqoW2kyowI","type":"Asset","createdAt":"2018-09-13T17:14:46.761Z","updatedAt":"2018-09-13T20:22:36.211Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-14)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6o5JGs7SuW2yWqoW2kyowI/952e40669a891420bd05ca7d719ee19d/TimeBug-Icons-_Day-14_.svg","details":{"size":244148,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-14).svg","contentType":"image/svg+xml"}}},"snippet":"Reflect on your relationship with money now and in the past.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/7xDrZxt21yik0QwuaQK204/5f142d699a1f3f75e40493eacbbbc226/20-20-33-Phase-2-Step-14.mp3"},"assignments":[{"icon":null,"content":"What emotions pop up when you think about your relationship with money? \n"},{"icon":null,"content":"What is your credit score?\nHas it changed over the years? If so, how so?\n"},{"icon":null,"content":"What was your biggest financial achievement over the past 5 years?\n\nWhat was your biggest disappointment over the past 5 years?\n"},{"icon":null,"content":"Where do you stand today compared to what you had envisioned for yourself? [A) I am way behind, B) I am a somewhat behind but close C) I am right where I need to be, D) I am a somewhat ahead, E) I am way ahead]"},{"content":"Do you have a balance sheet?\nIf yes, how does it make you feel?\nHow does it compare to a balance sheet from previous years?","icon":null},{"content":"Do you have a Profit and Loss Statement?\nIf yes, how does it make you feel?\nHow does it compare to a balance sheet from previous years?","icon":null}],"stepId":"14","workbookDurationMin":15},"15":{"number":15,"title":"Aims & Hobbies ... What About Me Time?","subtitle":"Phase 2: Assessment","description":"It’s time to perform the 3rd of 7 assessments – Personal Aims & Hobbies – of the last five years of your life.\n\nThis is a hard Pillar of Life to characterize. So many things can fall into it. For example, “getting fit” can be a “personal aim,” and “playing golf” can be a “hobby” or a part of your health regimen. While it is sensible for some things to cut across Life Pillars, for the purpose of these exercises, I recommend that you make a choice about what the more relevant category is for that activity or aim.\n\nFor this assessment, we are classifying Personal Aims & Hobbies as any topic or area of your life, aside from Career, Health, Travel, Relationships and Spirituality, that is for you to spend time doing whatever makes you happy – “Me Time.” Watching TV, reading books and learning a language are some examples. With how busy life can be, it is very easy – and I will count myself as guilty of this from time to time – to neglect your own needs and interests. Sometimes, you may just need to veg out on the couch, and catch up on your favorite Netflix or HBO series.\n\nA life that is go-go-go all the time is one that I predict is doomed for a crash. You need to focus energy on your hobbies to get a break from the demands being put on you by work, family, society and yourself! One of the key things to consider here is whether or not you are choosing aims and hobbies that boost your energy versus ones that drain energy.\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4VzUWHHteEEiiECUWWIEeo/a7f96056e554433e815b194bb8607d51/TimeBug-Icons-_Step-15_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Aims & Hobbies","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3KYHyEbvWM6w0eAwYumOkW","type":"Asset","createdAt":"2018-09-13T17:14:44.068Z","updatedAt":"2018-09-13T20:22:33.725Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-15)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3KYHyEbvWM6w0eAwYumOkW/196954be1a9c4ee93d86ae528cdd9510/TimeBug-Icons-_Day-15_.svg","details":{"size":247062,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-15).svg","contentType":"image/svg+xml"}}},"snippet":"Choose a few activities or hobbies that you enjoy engaging in every month and track how much time you spend on each.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/pqdoaOJHKSWM86Q4gmMCO/aef022b2abcf6ccc3cc5c035c16fa545/20-20-35-Phase-2-Step-15.mp3"},"assignments":[{"content":"What activities or hobbies do you typically engage in each month?\n- How much time does this hobby take up a month?\n- Has this amount of time increased or decreased since Year 1?\n- How does this activity make you feel?\n- Do you engage in this activity alone or with others? And if so, with whom generally?\n","order":1,"icon":null},{"content":"Which of these hobbies, if any, would you be willing to give up if some huge new priority came along, and required more of your time?\n- B) Which would you not give up under (almost) any circumstance?\n","order":2,"icon":null},{"content":"Were there any  aims & hobbies that you weren't able to accomplish that you really wanted to over the past 5 years?\n- B) What stopped you from initiating or continuing these hobbies?\n","order":3,"icon":null}],"stepId":"15","workbookDurationMin":15},"16":{"number":16,"title":"Health ... Am I Taking Care of Myself?","subtitle":"Phase 2: Assessment","description":"Now it’s time to take on the 4th of 7 assessments – Health (your current status and over the last five years). Health falls right in the middle of the 7 Pillars of Life because your personal health truly is central to and connected to every aspect of your life.\n\nWithout your health being in order, all the rest of your goals lose meaning and generally cannot be attained or enjoyed. This begs the question: how well are you taking care of yourself? Nobody can do that for you. This exercise will be put you- literally, physically – under the microscope to examine all aspects of your health. I have brought in one of our health experts – David Owens – to guide this part of the 20/20 journey. David is one of my closest friends; he is also my personal trainer, and, in many ways, a brother. I trust him implicitly. David has been in the fitness industry since 2002, is certified as a personal trainer through the Equinox Fitness Training Institute (EFTI), and is certified in Ayurvedic Nutrition, GYROTONIC®, and Moral Physics® from the Salas Sommer Institute. David, take it away!\n\n“Hi Everyone, and thank you Arman for the gracious introduction and this invitation to participate in the 20/20 Life Vision Challenge – I am honored. Your health is one of those valuable commodities that you may not pay attention to until it is compromised.\n\nThis is totally understandable, as in today’s world there are so many things that compete for and demand your attention. But, when you don’t feel well, and encounter a health challenge, depending on its severity, it usually takes center stage. Those are the moments when you truly appreciate the importance of good health. There are many facets to health – physical, mental and emotion- al – and each component requires your energy and attention. Learning how to attend to and balance your health needs is a process. As a child, you didn’t come with instructions, but over time, you can develop wellness skills, so that good hygiene and health become second nature and seamlessly integrate into your life.\n\nAlthough a large majority of us may share some common health benchmarks, we all are unique individuals with many factors that determine our health, such as – age, gender, genetics etc. We all have subtle differences. The point is not to compare yourself to others. This is your vision and you have to decide what role health plays in your life. Your position and feelings regarding health are not static, and may vary over time for a number of reasons. Being healthy impacts all areas of your life and requires your engagement and persistence.”\n\n- __David Owens__","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/1dS7I4W0aSAuyuuWeecESU/9b45909b4aeaa165d57fdf2bf8b968bd/TimeBug-Icons-_Step-16_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Well-being & Health","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6F9CUH4BhekSC8MIcm6EOu","type":"Asset","createdAt":"2018-09-13T17:14:41.441Z","updatedAt":"2018-09-13T20:22:31.002Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-16)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6F9CUH4BhekSC8MIcm6EOu/74319f20bd4bca15d8981e5d7fc3e587/TimeBug-Icons-_Day-16_.svg","details":{"size":250684,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-16).svg","contentType":"image/svg+xml"}}},"snippet":"Evaluate the state of your physical health, including your body strength, immunity, and stress levels.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/6SwEJwuy5OQIak4QwSso2W/98f09a77b858c98df7f9d4ce6c43c872/20-20-37-Phase-2-Step-16.mp3"},"assignments":[{"icon":null,"content":"- How much of a priority was your health over the past 5 years?\n- How do you physically healthy do you feel right now? (1 = Not very healthy and 10 = Very healthy)\n- Do you think you are a healthy person? [Y/N] "},{"icon":null,"content":"- Do you exercise? If not, why? (Y/N)\n- How many times a week?\n- What type(s) of exercise do you do?\n- What were your top 3 fitness goals from the past 5 years? (B) How would you classify them by the 7 Goal Outcomes?"},{"icon":null,"content":"- What is your typical diet?\n- How healthy is your diet? [1 = Not very healthy and 10 = Extremely healthy]\n- How many meals do you eat a day? [2 meals, 3 meals, 4 meals, 5 meals, 6 meals, other]\n- Do you make your own meals? [Y/N]\n- Do you eat organic? [Y/N]\n- Do you take supplements? (e.g., vitamins, protein shakes, etc.) [Y/N]\n- How often do you over-indulge with emotional eating – by either eating too much or eating junk food excessively? [Daily, 1-2x/wk, Occasionally (1-2x/mo), Rarely, Never]"},{"icon":null,"content":"- How many hours do you typically sleep a night?\n- Is that enough? If not, how many hours do you really need?\n- What is the quality of your sleep? (1 = Poor and 10 = Excellent)\n- Do you have any sleep issues? (Y/N) If so, why?\n- What time do you generally go to bed?\n- Do you drink coffee or take anything to stay awake or be energized daily? "},{"icon":null,"content":"- What do you do to physically take care yourself (e.g., massage, acupuncture, etc)? How often per month?\n- Where in your body do you carry your stress or tension?\n- Do you have any notable health issues? How prominent are they in your life? (1 = Very little effect and 10 = A daily challenge)\n- How often do you get sick? [# of days sick per year on average, from Year 1 to 5]\n- Do you take medications frequently? [Never, Only When Really Sick, Occasionally, Frequently, Daily] "},{"icon":null,"content":"- How stressed out are you throughout a typical week? [1= Totally tranquil and 10= Very nervous]\n- How do you deal with stress?\n- Are you able to express your emotions in a healthy way? \n- Describe how you communicate your feelings.\n- Are you aware of how stressful situations impact your health and life? Give 3 examples."}],"stepId":"16","workbookDurationMin":15},"17":{"number":17,"title":"Relationships… How Do I Connect With Others?","subtitle":"Welcome to Day 17 of the 20/20 Life Vision Challenge!","description":"There is no better way to learn about ourselves than through our relationships. They provide the ultimate mirror and an opportunity to connect with a deeper part of ourselves. In the context of goals, just think about when you achieve something great –you generally want to share it with someone or several people who you are close with. It is also a vital Goal Dimension, I feel – Relationship Quality (RQ) – to our overall happiness in life.\n\nI’d like to introduce you to one of our relationship experts – Ron Baker – to guide you in this Step. Ron is an insightful, compassionate and profound healer, therapist and guide to thousands of people, including myself, on a 1-1 basis as well as through his books and educational programs.\n\n“Thanks for the introduction, Arman. There is so much to say about relationships. It is hard to imagine breaking this topic down in a few paragraphs. Having done 25 years of work with thousands of people around the world, I am convinced that all of your relationships, including the most intimate partners in your lives, are reflections of the relationship you have with yourself.\n\nThe most basic determinant of the quality of your relationships is how safe you truly feel to give and receive in mutual value. Typically, when I ask my clients whether they feel safer to give OR receive, the vast majority of people say that they feel much safer giving. I suggest this is because it gives us the illusion of being the one “in control” when we give, followed by a typical experience of feeling vulnerable, exposed and sometimes even unworthy to actually receive. Rather than getting caught up in the psychological reasons WHY we might hold these fears, let’s challenge these limitations in some very simple and nurturing ways that have proved to be safe and effective in so many others’ lives – clear ways to make improvements in the quality of your day-to-day.\n\nIn closing, I remind you to “be good to YOU.”\n\n- __Ron Baker__\n[Ron Bakers Website](https://www.ronbaker.net \"Ron Baker\")","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4eju92kZuEWa4SSSWSwOAe/eb73b46725ba00c8ac18c23ba8fd950b/TimeBug-Icons-_Day-17_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Relationships… How Do I Connect With Others?","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"2QkLhiW1y8OuyWiAekYeGK","type":"Asset","createdAt":"2017-11-03T03:51:18.879Z","updatedAt":"2018-09-13T20:25:51.007Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":4,"locale":"en-US"},"fields":{"title":"TimeBug-Icons- Day-17 ","file":{"url":"//images.ctfassets.net/6h184bey8vl3/2QkLhiW1y8OuyWiAekYeGK/f1d062b95ae403960fd4f828a026f1da/TimeBug-Icons-_Day-17_.png","details":{"size":17593,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-_Day-17_.png","contentType":"image/png"}}},"snippet":"Today, you have on tap the 5th of 7 assessments – Relationships. There is no better way to learn about ourselves than through our relationships. They provide the ultimate mirror, and opportunity to connect with a deeper part of ourselves.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/7cvLKcHJFCGsuyGA8EmIam/5d8f8a67c14dc7d068cc1ca778aca6e2/20-20-40-Phase-2-Step-17.mp3"},"checkin":{"text":"In step 17, you listed your Relationship Quality(RQ) Goals. Use the Life Vision goal tracking system to help track your progress.","title":"RQ Goals","action":{"type":"link","payload":{"link":"journey/rewards?reward=17"}},"message":"It's time to check in with your RQ goals.","frequency":"Monthly"},"assignments":[{"icon":null,"content":"How do you typically treat yourself? (10 = With tremendous respect and 1 = With almost no respect)\n"},{"icon":null,"content":"How do you treat yourself during a learning curve, which inevitably involves making mistakes and learning from failures? (1 = Not at all patient and 10 = Very patient)"},{"icon":null,"content":"What messages run in your head on a daily basis about yourself?"},{"icon":null,"content":"What do you say to yourself to judge or shame yourself? \n- Whom do you truly value?\n- How many of these people do you love based on their weight or their waist size?\n- How many of these people do you treat with the same contempt and impatience that you do yourself?\n\n"},{"icon":null,"content":"How comfortable do you feel giving to others in your daily life?\nDo you trust the value of what you have to offer others? (10 = Very Trusting and 1 = Not trustful at all.)"},{"icon":null,"content":"How comfortable do you feel receiving from others in your daily life?\nDo you feel worthy and comfortable with compliments or acknowledgments from others? (10 = Very comfortable and 1 = Not comfortable at all)"},{"icon":null,"content":"What were your relationship quality goals over the past 5 years? \nClassify each by Goal Outcomes from Step 7.\n"},{"icon":null,"content":"Have you been in an intimate, committed relationship over the past 5 years? [YES / NO]\nIf so, how would you evaluate the quality of the connection and communication, on the whole? [1 = Poor and 10 = Very strong]"},{"icon":null,"content":"Which relationships improved over the past 5 years? With whom?\n"},{"icon":null,"content":"Which relationships regressed over the past 5 years? With whom?\n\n"}],"stepId":"17","workbookDurationMin":15},"18":{"number":18,"title":"Environment ... Am I In Sync With My Surroundings?","subtitle":"Phase 2: Assessment","description":"Do you believe that we actually get to choose our parents, as well as where and when we were born in this life? This is a very hard topic to “prove” in a traditional, scientific sense. I believe, as a facet of our karma and destiny, we come in to this life with a specific vision and purpose. As we become conscious of this vision, scenarios and environments lead to opportunities. You may move towards that truth through intuitive guidance from elders. Living in tune with nature can also align you towards your purpose.\n\nRegardless of what you believe, there is no denying the power that our environment has on our psyche and productivity. By environment, I mean everything from where you live, who you live with, the water and air quality of your city, what your study, work and rest areas are like, how often you travel to new places, your method of commuting to work and how much time you spend outside,away from technology and closer to nature.\n\nIn this modern, tech-centric era, with travel and relocation more accessible than ever, and now over 50% of the world’s population living in cities rather than rural areas, the dynamics of Environment for most people have evolved. We seem to have both more and less choices at the same time.\n\nThe goal of this exercise is to make you more aware of the impact of Place & Environment (PE, Goal Type 5) on your own health, happiness and productivity. Over the past 5 years, did you have any Place and Environment goals? How much of a priority was improving or exploring new environmental factors (e.g., moving to a more spacious apartment with more natural sunlight)?\n\nPersonally, travelling to new cities and countries is an essential ingredient for me to open my eyes and sustain my creativity and global awareness. It’s less about seeing tourist sites and more about tapping into different collectives and observing how humans in different parts of the world developed their societies, given their available resources. I feel like a new, different and more evolved person every time I return from travel.\n\nOn the other hand, you can make the “wherever you go, there you are” argument. You can never escape yourself, who you are and what makes you tick. Moving from New York to California may give you a change of weather and culture, but it won’t necessarily make you a more fulfilled individual. People often put too much weight and hope behind environmental changes, while not often enough taking responsibility for their own state of mind. Let’s take a stand against this kind of “passing of the buck” approach, and urge ourselves and all of our I’s (__Step 10__) to take ownership of our life choices.\n\nInterestingly, in spite of all my extensive global travels, I have always lived, studied and worked in or around New York City my entire life. So, as a result, I decided to take some input for this assignment here from my friend, Dali Singh, who has studied, lived and worked in at least five different cities.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4AhR9Ac4408U8Qa2WOooKm/709416e16da76e05e42020068b150d4d/TimeBug-Icons-_Step-18_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Environment","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"1RX1VTvgrKwwYICiUwSmYm","type":"Asset","createdAt":"2018-09-13T17:14:37.634Z","updatedAt":"2018-09-13T20:22:22.727Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-18)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/1RX1VTvgrKwwYICiUwSmYm/87748bc08dcaba212fa65f4a1eaa1e9a/TimeBug-Icons-_Day-18_.svg","details":{"size":261332,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-18).svg","contentType":"image/svg+xml"}}},"snippet":"Get in touch with your surroundings and ask yourself about your connection (culturally, physically, mentally) to the places you currently and have lived.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/2Q4aenD45qQaEysCMOMkq4/cba2f6aadbaf25dde61c7f92466f2b25/20-20-43-Phase-2-Step-18.mp3"},"assignments":[{"icon":null,"content":"What changes have taken place in your place and environment since Year 1? "},{"icon":null,"content":"Who do you live with right now?\nHow does that person influence your lifestyle choices?"},{"icon":null,"content":"Are you truly happy where you are or do you stay there because you are afraid of change (or because this is all you’ve ever known)?\n"},{"icon":null,"content":"Do you authentically connect to the culture in your town or city? (Y/N)\nAre you surrounded by like-minded people? (Y/N)\nAre your social needs met in this environment? (Y/N)\n"},{"icon":null,"content":"Do the climate elements (e.g., humid, dry, rainy, etc.) in your town / city suit you physically and mentally? "},{"icon":null,"content":"What were your place and environment goals since Year 1? \n\nClassify each by common Goal Outcomes from Step 7.\n"}],"stepId":"18","workbookDurationMin":15},"19":{"number":19,"title":"Spirituality ... Do I Know Who I Really Am?","subtitle":"Phase 2: Assessment","description":"God and Love are the two most confusing and complicated subjects to contemplate and discuss for nearly everybody. Both subjects touch upon everything that we do, and color all of our plans and goals. What you believe may be different from what you were taught as a child, or felt was true 5 years ago.\n\nSpirituality, much like Health, is influential regardless of whether you prioritize it. It is essentially your life philosophy about what you believe it’s all about, and how that impacts how you think, feel and act.\n\nThese are big questions, and not ones that can be answered by the intellect or within any short period of time. It is a lifetime’s work for those who are willing to dedicate themselves to an honest self-inquiry process. All of the sincerest, emotionally strongest and authentically happiest people who I know are ones that have placed Spirituality as the #1 priority in their lives.\n\nThe great Chilean Spiritual philosopher, Dario Salas, sums it up best in his latest\nmasterpiece of a book – Cosmic Currency – as follows:\n\n        “... the option to live in the being, through the being and for the being,\n        according to the universe’s highest laws, offers a bonus for the human\n        individual and can lead to the most profound happiness, harmony, or-\n        der, coherence and wisdom. This depends only on oneself. The human\n        being has inherited a particle of the universe’s divine light and needs the\n        requisite insight to understand that, although in the tiniest amount, this\n        particle is “heaven’s light.” It is what is called the spirit or the being and\n        it is one’s most sacred duty to care for and develop it. If successful, one\n        will have the moral and executive authority of the righteous, allowing one\n        to secure the necessary spiritual and material resources. Then, one will\n        not be just a millionaire bereft of spiritual resources, but a complete and\n        balanced person.”\n        \n## Think about life’s most profound questions...\n\n__1. Purpose__. Why am I here on Planet Earth and in this human form? What is my purpose?\n\n__2. Self-Knowledge__. Who am I – on a deeper level, beyond the human form, race, gender and nationality that I came into being as?\n\n__3. Karma__. Why do things happen to me and others in the world as they do (e.g., the good, the bad – wars, crimes, etc.)? Is it random or predestined?\n\n__4. Destiny__. Who is in charge here? Do I have to be compliant with a specific religion or Spiritual path in order to be at peace with myself and be in God’s good graces or is God within each of us, allowing me to co-author my own destinies? Or is everything just random?\n\n__5. Healing__. How can I feel tranquil and connected to “something beyond myself” on a day-to-day basis? How do I move through and beyond the painthat I have experienced in life?","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/6Bh8G69f0Wo0wueGquUcuG/ec24ffdd463e7f31e95a290b91c948f0/TimeBug-Icons-_Step-19_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"Spirituality","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3STiQ8kaNiSu8UkCOY2oQI","type":"Asset","createdAt":"2018-09-13T17:14:34.642Z","updatedAt":"2018-09-13T20:22:17.589Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-19)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3STiQ8kaNiSu8UkCOY2oQI/9c38627a71f05c78e9bf280b7ffa8b3a/TimeBug-Icons-_Day-19_.svg","details":{"size":269289,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-19).svg","contentType":"image/svg+xml"}}},"snippet":"Think about your spiritual self and what internal qualities of yours have been impacted by spiritual practices. ","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/68yhyR0gjmOkYcYkgGmkkO/f9fb91246078470269401e30d0f07f58/20-20-45-Phase-2-Step-19.mp3"},"assignments":[{"icon":null,"content":"What are your current views and feelings about spirituality? What does it mean to you?\nWho and what influenced your spiritual views early on in life?\nWho are your current role models or mentors in this area? Why do you admire their approach to and views on life? "},{"icon":null,"content":"How much time do you spend each week on spiritual practices, interactions, reading, writing, etc.?\nHow have your spiritual practices and/or beliefs changed over the past 5 years?"},{"icon":null,"content":"What Internal Qualities (IQ, Goal Type 4) have been influenced – positively or negatively – by your Spiritual practices – or lack thereof?\n\nWhat insights did you pick up from your spirituality over the past 5 years?\n\nMy Purpose on Planet Earth is ....\nBeyond my outer form, I am ....\nMy Karma has shown me ....\nDestiny is determined by ....\nI have healed emotional wounds from ..."}],"stepId":"19","workbookDurationMin":15},"20":{"number":20,"title":"5-Year Life Review & Reflections","subtitle":"Phase 2: Assessment","description":"Let’s discuss an effective process for periodic reviews, with a focus on the past 5 years. It is important for you to focus on both Quantity (of Time & Energy) and Quality indicators across the different areas of your life, keeping in mind the 7 Goal Dimensions (or Types), covered in __Step 5__.\n\nTo be technical about achieving your Life Vision, you must embrace your own qualities, numbers and the realities of how much time and energy it takes to get meaningful things done.\n\nI ask that you review the ideas and information that you have shared thus far through prior Steps completed, and apply them in the present moment and the past 5 years of your journey. Be as objective as possible without judgment or embellishment.\n\nIf you need help being objective and grading yourself here, ask your Advisors for some feedback. For example, when I recently had some challenges with one of my business partners, I had strong feelings but wanted to check with someone outside the situation to make sure I wasn’t being biased. I reached out to David Houle, one of my business mentors; and he gave me some great insights,as well as reassurance that my feelings were valid. David has checked my perspective frequently, and often presents alternative points of view. Whether or not I agree with him in the end, having those exchanges helps me assess the whole picture more objectively, and ensures that I’m not getting “stuck” in oneline of thinking.\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/1KEfOUNZmMu2cwqIYO0Gcy/93f5fb3853e57a1833b8ca585b84c883/TimeBug-Icons-_Step-20_.svg"},"type":"SELF-ASSESSMENT","color":"#F78C00","duration":30,"stepScreenDescription":"5-Year Life Report","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"59ueOtyl7iMM2McKCM8qCO","type":"Asset","createdAt":"2018-09-13T17:14:33.948Z","updatedAt":"2018-09-13T20:22:16.653Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-20)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/59ueOtyl7iMM2McKCM8qCO/1be0fea7b2bce49ec0628b29972801b8/TimeBug-Icons-_Day-20_.svg","details":{"size":275163,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-20).svg","contentType":"image/svg+xml"}}},"snippet":"Conduct a review and reflection report of the past 5 years.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/SsJvoxznigu6m2YCK8wuU/6f253b359ef93f1a8df248777d944566/20-20-47-Phase-2-Step-20.mp3"},"assignments":[{"icon":null,"content":"Reflect on your Step 11 entry (The 5-Year Life Report) and make refinements or additional notes. Be more technical and detailed, especially about how you spent your Time & Energy. "},{"icon":null,"content":"Reflect back on your Step 2 entry (More or Less Time) and refine your vision on how you want to spend your time over the next 5 years.\n\nHow would you like to ideally break down time across the Pillars of Life?\n"},{"icon":null,"content":"Reflect back on your 7 Assessments (Steps 13-19): \n\nRank each of the 7 Life Categories in order of importance to you over the past 5 years (10= Very Important and 1= Not important at all)\n\nHow would you divide your energy and motivation level as a percent of a pie for each Category?\n\nGive yourself a final evaluation for each of the past 5 Years, as well as an overall 5-Year Score (1-10 score per year per Life Category for a total maximum high score of 50/50).\n\nHow do your scores compare to the scores others give you per Life Category? "}],"stepId":"20","workbookDurationMin":15},"21":{"number":21,"title":"How do I Plant & Nurture Seeds in My Life Garden?","subtitle":"This is Day 21 of the 20/20 Life Vision Challenge.","description":"Exit Phase 2 – Self-Assessment. Enter Phase 3 – Vision Creation.\n\nIt’s finally time to break out that bucket list and bring all of your forward-looking dreams and Big Hairy Audacious Goals (BHAGs) to the table.\n\nFor all of your existence, seeds were planted daily in your life garden. Seeds reflect possibilities and your potential in all aspects of life. How and what those seeds grow to be is entirely dependent on the attention and nurturing that they get. Some will turn into weeds due to neglect. Others will grow beyond your control and imagination, taking on a life of their own. As you set out upon creating a 20/20 Vision, it is imperative to take full ownership of the seeds planted in your garden. Your Internal World (__Step 10__) was, and likely still is, largely influenced by others, who hopefully plant good seeds. As an adult, it is your responsibility to take control over your garden.\n\nThink Big. Now is the time. Let go of your fears and limitations for the next half-hour, and imagine that anything is possible – because it virtually is. Close your eyes and repeat your 20/20 mantra (from Page 2-3) three times. Keep your mantra handy and come back to it during each Step within this Vision Creation portion of your Journey.\n\nThe deeper you are able to silence the skeptical inner voices, the higher your chances of success will be. Keep practicing this – and other positive mantras, maybe something of your own writing – every day, even if you have to say it 100 times before it “feels” true. You have to believe it as if it already is – that is part of how successful vision creation works – as if you are seeing into the future and feeling the reality of it.\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/22aJxnFTecEYAcEYMYgMkU/b04976f13864fc181bc883b0996a7553/TimeBug-Icons-_Day-21_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Planting & Nurturing Seeds in Your [Life] Garden","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"4HnoN3kNLWA0OIO0qMwu42","type":"Asset","createdAt":"2017-11-03T03:50:51.559Z","updatedAt":"2018-09-13T20:24:53.191Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":4,"locale":"en-US"},"fields":{"title":"TimeBug-Icons- Day-21 ","file":{"url":"//images.ctfassets.net/6h184bey8vl3/4HnoN3kNLWA0OIO0qMwu42/2385d17af70a5a730fbe3d4dfd4ea62d/TimeBug-Icons-_Day-21_.png","details":{"size":21837,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-_Day-21_.png","contentType":"image/png"}}},"snippet":"It’s finally time to start breaking out that bucket list, and bringing all of your forward-looking dreams and BHAGs (Big Hairy Audacious Goals) to the table. Are you ready?","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/61GA9vpaP6E0EwW282aIMA/1d79b8cca5bce01abd55561dc9db5fc4/20-20-51-Phase-3-Step-21.mp3"},"checkin":{"text":"In step 21, you discussed the planted 'skill-seeds' in your Life Garden. You'll find it helpful to check in with them and update your growth in these areas!","action":{"type":"link","payload":{"link":"journey/rewards?reward=21"}},"message":"It's time to check in with the seeds you planted in your Life Garden.","frequency":"Monthly"},"assignments":[{"icon":null,"content":"Imagine different Life Categories in your life garden. \n\nWho planted most of the seeds in your garden over the course of your life? \n\nAre you committed to taking full ownership of your life garden from this point forward?\n"},{"icon":null,"content":"Reflecting on the 7 Self-assessments ove Steps 13-19, list two Big Hairy Audacious Goals (BHAGs) that you'd like to plant for this next year.\n"},{"icon":null,"content":"Think about how strong your current tools (e.g., skills, approach, etc) are for tending to your garden. \nWhat skills do you have? How profient are you in each? (1 = Beginner and 10 = Master) in each.\n\nWhat level do you aspire to reach in each skill in this next year?\n\nHow will you improve those skills?\n"}],"stepId":"21","workbookDurationMin":15},"22":{"number":22,"title":"What Do I Dream (Literally) About?","subtitle":"This is Day 22 of the 20/20 Life Vision Challenge!","description":"Let’s tap deeper into your unconscious and draw out your deepest dreams and aspirations for this existence – your life’s purpose.\n\nI’ll start by sharing the story of Jason Stile, who I nicknamed “The Dreamer.” Jason is a friend and business partner in the up-and-coming product development company, Ajustco. He was an electrician who aspired to be an Entrepreneur and do bigger things in life.\n\nJason took an inspirational program called “The Money Workshop” at Dario Salas’ Institute for Hermetic Philosophy in New York City, and soon after setting an intention to receive inspiration for a great business idea, Jason had “the dream” during one night’s sleep – clearly envisioning a product that solves misaligned door and gate issues. This acted as a seed for the flagship product called AjustLock, a beautiful, fruit-bearing tree that is now a highly successful company, which continues to grow every day.\n\nThe key messages that come across are that: A) Your dreams (and unconscious mind) have transformative and illuminating power, B) You can achieve anything that you set your mind to, and C) No obstacles or setbacks are too great to overcome when you have sufficient will power.\n\nGood luck Dreamer!","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4AjRkIo3ba0o6yGkQ8UGGG/8e2dcd418d0d52f26a2a8402c51e196a/TimeBug-Icons-_Day-22_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Following Your Dreams (Literally)","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3QYNB7S0YEwuKgSkiuuKOI","type":"Asset","createdAt":"2017-11-03T03:50:46.631Z","updatedAt":"2018-09-13T20:24:46.735Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":4,"locale":"en-US"},"fields":{"title":"TimeBug-Icons- Day-22 ","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3QYNB7S0YEwuKgSkiuuKOI/4b20c90317dcdaa0001325dc76855595/TimeBug-Icons-_Day-22_.png","details":{"size":18347,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-_Day-22_.png","contentType":"image/png"}}},"snippet":"To this point, we have used various visualization techniques to draw out aspects of your life vision, from deep within your core. That all culminates in today’s core lesson – How to be a Dreamer.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/1HT1ZJCgscAIOQo0GQgOcC/34b4449b24550ee4a98aed871db6534a/20-20-53-Phase-3-Step-22.mp3"},"checkin":{"text":"Writing down and reflecting on one's dreams is a great excersize in introspection. You may be surprised at what kind of insights can come from this process. Keep up with your dream journal!","title":"Dream Journal","action":{"type":"link","payload":{"link":"journey/rewards?reward=22"}},"message":"Did you have any significant dreams last night? Why not write about them in your dream  journal?","frequency":"Daily"},"assignments":[{"icon":null,"content":"Here are some activities you added on Step 8 [autopopulate those activites]. \n\nWhat activities did you engage in today? \n\nAt what time of the time did you engage in them? (e.g., morning, afternoon, tonight)"},{"icon":null,"content":"What do you dream about?\n- Any general themes? \n- How often do you remember your dreams? [Choices: (A) Daily, (B) Most of the time, (C) Occasionally, (D) Hardly ever, (E) Never]\n- Have your dreams ever come true – as in, you dreamt about something and then it happened? [Y/N] If so, list an instance when that happened. \n- For the remainder of the program [8 Nights of Dreaming], try to remember and write your dreams down first thing in the morning – or even if you wake up in the middle of the night, the way Jason described his experience in the video. Note what themes, characters, settings, fears, hopes and aspirations were present.\n"},{"icon":null,"content":"In this moment, dream about everything you want your life to be. Anything is possible. Describe what you see.\n\nWhat are your life dreams?\n"}],"stepId":"22","workbookDurationMin":15},"23":{"number":23,"title":"What are My Career Dreams?","subtitle":"Welcome to Day 23 of the 20/20 Life Vision Challenge!","description":"On __Step 13__, you contemplated to what degree you are doing what you love. In this Step, we flash forward 5 years from now, and the answer is a resounding “YES!!” Think about what needs to be done over the next 5 years in order for that statement to become a reality.\n\nI’ll share some of my own career dreams. In 1996, I graduated from Columbia University in New York City, where all major banks and consulting firms recruit top “talent” every year, giving them big salaries and putting them on the corporate “fast track” to success. It was the American Dream at work – to compete and be on top of the world, in the world’s finance capital, Wall Street! I did what everyone else did – set up interviews and researched these companies, prepared answers to tough questions like a scene from The Devil’s Advocate, The Firm, or Wall Street. I got offers, and considered them.\n\nBut, I wasn’t feeling it. The start-up technology world really inspired me. The thought of having to take risks to bring new, innovative products and services to life was exciting. I had an inkling of a vision for my career track, and it didn’t include a big corporation.\n\nSo I took a chance by joining my friend, Charles Balsamo, as a co-founder at a Smart Car Startup called Exeter Technologies. He was CEO and I was CFO, titles we knew little about, but grew into over the next three year. I did all the Sales and Marketing, Research and Development, Human Resources and Finances. It was the building of my foundation and experience in the startup venture world and I loved every minute of it, even the all-nighters, where we had to work around the clock to meet major deadlines. When you really love what you do, it doesn’t feel like work. And that is what I have always sought after. 20 years later, I continue this journey, doing what I love every single day.\n","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/6kdUQpjLGgKSo6y8OwWUMg/86045a88ada5294ff2809a9e6e990eda/TimeBug-Icons-_Day-23_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Career Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"1I6eBw9oHqS6gi6oQSW4ky","type":"Asset","createdAt":"2017-11-03T03:50:45.775Z","updatedAt":"2018-09-13T20:24:45.596Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":4,"locale":"en-US"},"fields":{"title":"TimeBug-Icons- Day-23 ","file":{"url":"//images.ctfassets.net/6h184bey8vl3/1I6eBw9oHqS6gi6oQSW4ky/3d7b04c95fe2cc9c5a84afdc439dae4f/TimeBug-Icons-_Day-23_.png","details":{"size":16867,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-_Day-23_.png","contentType":"image/png"}}},"snippet":"The same question that I posed on Day 13 comes up again – “To what degree are you doing what you love?” Today, the answer is a resounding “YES!!” Now what needs to be done over the next 5 years in order for that statement to become a reality?","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/5kIjcqTWgwwGguAeukMmg8/2336d3fd57a5e091226760e291ad231a/20-20-55-Phase-3-Step-23.mp3"},"checkin":{"text":"In step 23, you listed your large-scale career dreams. Use the Life Vision goal tracking system to keep track of your progress.","title":"Career Dreams","action":{"type":"link","payload":{"link":"journey/rewards?reward=23"}},"message":"It's time to check in with your Career BHAGs!","frequency":"Monthly"},"assignments":[{"icon":null,"content":"Check-In: Have you done your – (A) Mantra, (B) Exercise, and (C) Meditation yet today? If not, now’s the time. [Check Boxes]\n"},{"icon":null,"content":"If you could change jobs and do something totally new, what would it be? "},{"icon":null,"content":"Reflecting back on exercise 13, what changes would you need to make in your career to increase your fulfillment and motivation levels to 10 (Extremely fufilled/motivated)? "},{"icon":null,"content":"Back on Step 21, you were asked to list your Big Hairy Audacious Goals (BHAGs). Focusing on Career only now, take that a step further by adding 3-5 more Career BHAGs."},{"icon":null,"content":"Also on Step 21, you thought about the specific skills that you are looking to build over the next 5 years. Go deeper now, with a career focus, what 3-5 career specific skills do you plan to develop?\n\nWhat specifically will you do in this next year to develop those career-related skills? \nHow much time will you dedicate to this professional development (per week)? #Skillbug\n"},{"icon":null,"content":"The average worker spends 40 hrs * 50 weeks working = 2,000 hours. How many hours will you spend working this year? #Workbug\n"}],"stepId":"23","workbookDurationMin":15},"24":{"number":24,"title":"What are My Money Dreams?","subtitle":"Phase 3: Vision Creation","description":"Now, it’s time to consider how you want your relationship with money to change over years to come. This is not just about how much money you have or make. It is about how you think and feel about the world of things and how skillfully you are able to operate in that world. We’ve all heard the phrase “More Money, More Problems” – a popular lament of the rich and famous – who often- times have difficulty managing money. While we may idolize these celebrities for their stature and seeming access to the finer things in life, why does it seem that many of them are not all that happy? I believe it has to do with two main factors:\n\n1) Money may be nice to have, and can surely temporarily help you live a more comfortable and stress-free lifestyle (if managed well), but it does not bring long-lasting joy.\n\n2) The energy surrounding money and material things is overwhelming, and attracts many negative forces. Think about the entourages and all-of-a-sudden “friends” that wealthy athletes have after signing big contracts. Everyone lining up for the money train, including financial “advisors,” lawyers and others that “want to help,” causes confusion. These folks did not build a proper Board of Advisors.\n\nYou don’t have to be multi-millionaire celebrities to experience these negative effects. The pure chase for money and things, as well as your insecurities over financial status, can drain your vital energy, and sabotage positive traits. The trick is to build a positive relationship to the material world, and not let it take over your soul. When it comes to the material world, it should ideally be a reflection of the state of abundance and joy that you feel within.\n\n# As the Hermetic saying goes...\n\n“As Above, So Below“\n\nAs Within (Internal Wealth), So Without (External Wealth).","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/4KBRtQduWc8k48aYqGyskG/7e9c56125643cc59c289e2eb7dca169c/TimeBug-Icons-_Step-24_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Money Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6RiNa6It2M2qsi20ek0IOQ","type":"Asset","createdAt":"2018-09-13T17:15:52.140Z","updatedAt":"2018-09-13T20:23:53.834Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-24)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6RiNa6It2M2qsi20ek0IOQ/1d79c7dfdbe2efe4468479b88305ed73/TimeBug-Icons-_Day-24_.svg","details":{"size":307924,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-24).svg","contentType":"image/svg+xml"}}},"snippet":"Challenge yourself to think about your career Big Hairy Audacious Goals (BHAGs). ","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/22gaZWhooQQ2e4gq2UMukw/3fe3a5ad09bea40bb9dceab38078a14b/20-20-57-Phase-3-Step-24.mp3"},"assignments":[{"icon":null,"content":"Five years from now, how much money will you have in the bank? \n\nWho is your “finance team” that helped you not only to attain but also manage your financial success?\n\nWhat do you plan to do with any excess money that you come into over the next 5 years?"},{"icon":null,"content":"- How will your life differ 5 years from now due to your  money BHAG acheivements?\n- How much more or less will you work as a result?\n- How many days a year will you take off for vacation?\n- What additional material things will you have or have access to that you now don’t?\n- what emotions will you feel as a result that you don't feel now?"},{"icon":null,"content":"Who do you want to succeed with or change his / her relationship to money?\nHow do you want them change his/her financial fortunes in 5 years?\nHow can you help him/her achieve this goal? "},{"icon":null,"content":"What one wish do you have for the world or a particular sector of the world relating to money?\n\nWhat group of people or country can be most influential in helping this goal be attained?\n\nHow can you help, be it in any small way, to see this goal achieved?"}],"stepId":"24","workbookDurationMin":15},"25":{"number":25,"title":"What are My Personal Dreams?","subtitle":"Phase 3: Life Vision","description":"Are you a person who likes to joke around and laugh a lot? Then, maybe reading comics, watching funny movies, going to comedy clubs or just spending quality time with your best friends who make you laugh needs to be a priority in your busy schedule. If you like to sing, dance and be expressive, maybe a weekly karaoke night or learning an instrument could be in the cards for next year?\n\nA well-balanced life with core competencies in many areas is generally more fulfilling than one in which you have “success” in a few, while other areas suffer. Imbalance in any one area almost always causes dysfunction everywhere. Think about a “successful” business executive, who is at the top of his or her trade but who also travels a lot and works long hours and has poor health and a suffering home life (e.g., A broken marriage, non-relationship with kids and a few weekend hobbies). This person’s energy investment is 65% career and 20% personal finances with high fulfillment, while the rest (personal hobbies, health, spirituality etc.) below 3% with low fulfillment levels.\n\nSo with work life and overall life balance in mind, think about what “Me Time” activities and pursuits may give your life that added charm and sense of fulfillment over the coming years.\n\nDream big here and don’t be held back by your inhibitions. These feats can be built up gradually over the next 5 years.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3zDI5TKBbqOsEeg6sQ6c6c/9e8a210688d53ec1d883d84814fd1aa0/TimeBug-Icons-_Step-25_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Personal Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"3iqeKdtcbSGWCQaIMwOQAg","type":"Asset","createdAt":"2018-09-13T17:15:45.211Z","updatedAt":"2018-09-13T20:23:44.306Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-25)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/3iqeKdtcbSGWCQaIMwOQAg/3491ca12c33d8bfc527339102832eed8/TimeBug-Icons-_Day-25_.svg","details":{"size":315449,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-25).svg","contentType":"image/svg+xml"}}},"snippet":"Think about what “Me Time” activities and pursuits may give your life added charm and a sense of fulfillment over the coming years.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/1ZZrBiXPUkIcqsmS28iQgM/ab483dde0a28a202b72f9c6ea3483ef9/20-20-59-Phase-3-Step-25.mp3"},"assignments":[{"icon":null,"content":"What activity and hobby goals will you achieve 5 years from now? \nHow would you rank these goals in terms of priority? (1= Low priority and 10= High priority)\nHow many hours per month do you plan to spend, on average, on each personal hobby or activity?"},{"icon":null,"content":"Which areas in your personal time will you cut down on or out completely? "},{"icon":null,"content":"Who you want to see enjoy more time for themselves, doing the things that you know would make them happy? \n\nHow will you help them attain those personal goals 5 years from now?\n"},{"icon":null,"content":"What's one wish that you have for the world or a particular sector of the world relating to personal aims and hobbies?\n\nHow can you help encourage others to help actualize this world goal?\n\nHow can you help, be it in any small way, to see this goal be achieved?"}],"stepId":"25","workbookDurationMin":15},"26":{"number":26,"title":"What are My Health Dreams?","subtitle":"Phase 3: Vision Creation","description":"Hello again everyone. It’s David Owens (first introduced on __Step 16__). This current Step is usually where you begin to bump up against some of the internal (e.g., inner negative voices) and external (e.g., finding time) obstacles that can prevent you from reaching your goals. The good news is that, with persistence and creativity all the goals you seek to achieve can be accomplished. You have to be honest and fair though as well.\n\nFor example, if you’ve never run long distance in your life, you are potentially setting yourself up for failure if you aspire to run a marathon in one month, and do so in under 3 hours. Set goals that will inspire you to stretch yet that are also within your grasp, and not so challenging that you become discouraged. Also, don’t be afraid to try new things (other than a gym workout) that better fit your persona. Try tai chi, yoga, Gyrotonic or swimming.\n\n        __David Owens__\n\n## Remember the basics:\n\n__Nutrition and Diet__\nThough it is cliché – you are what you eat. Being active is very important; but what you eat, the quality of the food and the quantity are factors if not taken into consideration, can undo all of the hard work you put in. If you don’t like to cook, consider looking into food companies that make healthy pre-packaged meals. If you like to cook or want to learn a new skill, the culinary arts are wide open for exploration.\n\n__Sleep__\nSleep hygiene is such a highly under-appreciated component to your health and well-being. Everyone has different requirements for the amount of sleep they need to operate at an optimal level, but the quality of the sleep is just as important. If you consistently need coffee or other stimulants to make it through the day, you’re not getting enough quality sleep. Try out a sleep ritual, and consider avoiding late night eating and use of electronics.\n\n__Body Care__\nJust like a car, your body needs maintenance and check-ups (not necessarily of the medical doctor kind). Massage, acupuncture and chiropractic adjustments are some of the more popular alternative means of self-care.\n\n__Mental and Emotional Health__\nAs a complex being, your mental and emotional health are key components to your physical health. Make sure you have someone to talk to, whether it’s a friend or a professional. We need to be heard and understood. Stillness is another very important part of our overall health. Being active is one part, but consciously being still and feeling is equally important, as our energy needs to move like waves or alternating cycles instead of always going in high gear. Not moving or thinking is the important opposite that balances out all of our physical and mental activity.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/16LMXn0DTGeCqqKewYwYS8/d635fd5be1faf6b55ff8a24051c69b56/TimeBug-Icons-_Step-26_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Health Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"4twOxB14U0kwqei6mok4wo","type":"Asset","createdAt":"2018-09-13T17:15:33.802Z","updatedAt":"2018-09-13T20:23:34.707Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-26)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/4twOxB14U0kwqei6mok4wo/b8847a610174ab8cee8e949dbeb1b255/TimeBug-Icons-_Day-26_.svg","details":{"size":321618,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-26).svg","contentType":"image/svg+xml"}}},"snippet":"Put away those inner negative voices and accept new ones that launch you into a new, healthier you.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/5xGeqpzAPYa0UM4oMQmMm2/55feca2ee37f275a34a167e7296c6c3d/20-20-61-Phase-3-Step-26.mp3"},"assignments":[{"icon":null,"content":"What changes and achievements will you make across the following areas?\n- Prioritizing your Health Goals vs. other Areas\n- Fitness & Exercise\n- Nutrition & Diet\n- Sleep\n- Body Care\n- Mental & Emotional Health "},{"icon":null,"content":"Who you want to make drastic improvements in their physical health?\nHow exactly do you want them to change?\nHow can you help them achieve this goal? "},{"icon":null,"content":"What's one wish that you have for the world or a particular sector of the world relating to Health?\n\nWhat group of people or country can be most influential in helping to attain this goal?\n\nHow can you help, even in a small way, to acheive this goal?\n"}],"stepId":"26","workbookDurationMin":15},"27":{"number":27,"title":"What are My Relationship Dreams?","subtitle":"Phase 3: Vision Creation","description":"Back on __Step 17__, you took stock of the current state of your relationships. Today, with our resident Relationship Expert – __Ron Baker__ – we take that topic forward into your 20/20 Vision.\n\nThere is no such thing as creating in a vacuum and it is when we come together to support one another in mutual value that everyone serves the perfect parts of one another’s dreams. Deepening your value of self is integral to valuing and interacting with others in the balance of giving and receiving.\n\nWe live on a planet that has primitive emotional tools and education. However, I witness my clients making major improvements in the quality of their lives, as they learn to reconnect to the emotional and experiential body.\n\nWhen it comes to relationships, I want to share that I do not believe in magical thinking. I believe that an enhanced reality is built by making a clear investment in the specific goals and experiences that you decide are important in your life. Whatever you practice the most is what you become best at. And so I hope you will find this exploration of your relationship choices helpful and that you feel encouraged with some specific hints at building a more fulfilling relationship network in your life. I know it is entirely possible, one day at a time.\n\n    __Ron Baker__","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/5BqVoV8guI4ksKqQ2OYGyO/533c0b0b9dc0811bd33689ed546cc6f9/TimeBug-Icons-_Step-27_.svg"},"type":"VISION CREATION","stepScreenDescription":"Relationship Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6rp2qSa2hGMSCoiomcsisi","type":"Asset","createdAt":"2018-09-13T17:15:20.153Z","updatedAt":"2018-09-13T20:23:14.696Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-27)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6rp2qSa2hGMSCoiomcsisi/aad0102fb385b59fa08e47adcc5f3198/TimeBug-Icons-_Day-27_.svg","details":{"size":325891,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-27).svg","contentType":"image/svg+xml"}}},"snippet":"Challenge yourself to explore your relationship choices and contemplate new ones.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/62tcprn9o4Ay4OKMAquuI4/5714c4267ea12e0fc57d57379bd3777b/20-20-63-Phase-3-Step-27.mp3"},"assignments":[{"icon":null,"content":"Take in a deep breath. Then, breathe fully out of the mouth. What does your nervous system think about this receiving and giving of breath?\n\nWhat old thoughts will you replace with new ones that will create new trust and a new experience? (e.g., Old Thinking = “Missed another workout today. I am so lazy.” vs. New Thinking = “Maybe I’m not getting enough rest. I’m going to take it easy on myself today.\").\n\nWhat will your relationship to self look like in 5 years?\n"},{"icon":null,"content":"What are 3 feelings that you will feel about yourself 5 years from now?"},{"icon":null,"content":"Who are 3 different people you will value or value more than you do now?  \n"},{"icon":null,"content":"What 3 needs (physical, emotional or mental) will you have in your life 5 years from now? \n\nAre you willing to communicate these needs to another person in the spirit of mutual giving?\n"},{"icon":null,"content":"What do you want to give more of to others in 5 years? \nWhat do you want to receive more of from others in 5 years? \n"}],"stepId":"27","workbookDurationMin":15,"duration":15,"color":"#00B896"},"28":{"number":28,"title":"What are my Environment Dreams?","subtitle":"Phase 3: Vision Creation","description":"Contemplate deeply and set your intention on what the ideal surroundings are for you, in terms of your primary residence (country and city), home environment, frequency of travel and day-to-day settings (i.e. exposure to outdoors, nature, pollution, city life, etc.).\n\nIt is hard to predict where life is going to “take us” in terms of new opportunities, people we will meet and places we will have to go in the future. Remember, that we are co-creators in that process, not just beholden to forces that are completely out of our control. This is your chance to set your intention and tap into what life wants from you, and vice versa. Feeling out where you need to be, and what kind of environment is optimal for your happiness and success in life, requires sensitivity and experimentation.\n\nDo not limit yourself here. Let your imagination be open to future possibilities that may not seem logical or feasible given your current circumstances. At the same token, there are numerous practical life hacks and subtle adjustments that you can make now, that simply require you to decide on and do. Here are some good examples:\n\n1) Buy some new plants and put them near your most common work, eating and lounging areas at home and/or work.\n\n2) Take a walk outside where it is quiet, near trees and nature, even if just for 5 minutes, daily or several times a week.\n\n3) Plan a trip out of your day to day environment, even if it’s just for a day or two, and it can also be very close by, like a “Staycation” but in a new place – like a friend’s house or hotel or camping.\n\n4) Create a room in your home with “No Tech” or “Low Tech,” meaning no TV, Alexa or Computer.\n\n5) Buy and burn some incense or aromatherapy candles a few times a day.\n\n6) Rearrange your desk or work space somehow; face a new direction, tidy up your paperwork and add a inspirational touch or two, like a poster or painting, hourglass, globe or some other trinkets.\n\n7) Buy a new pillow and/or blanket to enhance your sleep – maybe an ergonomic one that’s good for your neck and back.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/2kCyurjqG8C22QaoEYWagc/1349ad162f54ce040f93217ad9d89f25/TimeBug-Icons-_Step-28_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Environment","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"33HfTT6yI8I4yw0MUAM6oI","type":"Asset","createdAt":"2018-09-13T17:15:11.099Z","updatedAt":"2018-09-13T20:23:05.766Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-28)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/33HfTT6yI8I4yw0MUAM6oI/251a6ed2bef107c9b4065fdf5043e209/TimeBug-Icons-_Day-28_.svg","details":{"size":341242,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-28).svg","contentType":"image/svg+xml"}}},"snippet":"Contemplate and set your intention on what the ideal surroundings are for you.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/4dbI6sFYXYCeaUUkUemYeU/65410ad3c8dd1950800769fbb1ef224e/20-20-65-Phase-3-Step-28.mp3"},"assignments":[{"icon":null,"content":"Check-In: Have you done your – (A) Mantra, (B) Exercise, and (C) Meditation yet today? If not, now’s the time. [Check Boxes]"},{"icon":null,"content":"What major goals [BHAGs] do you envision for yourself 5 years from now? \n\nWhat's on your 2020 place and environment bucket list?\n\nHow do you rank each bucket list item in terms of priority (1= Low priority and 10= High priority)?\n\nHow much time per year (for each of the next 5 years) will you spend, on average, working towards each BHAG and/or bucket list item?"},{"icon":null,"content":"Who in your life do you want to enjoy a major transformation in their place and environment surroundings?\nWhat do you want them to accomplish 5 years from now?\nHow will you help them make it happen by Year 5?"},{"icon":null,"content":"What’s your place and environment wish for the world or a particular sector of the world?\nHow can you help, be it in any small way, accomplish this goal?\n"}],"stepId":"28","workbookDurationMin":15},"29":{"number":29,"title":"What are My Spirituality Dreams?","subtitle":"Phase 3: Vision Creation","description":"I am connected to a Sufi group called the Nur Ashki Jerrahi Community which pay particular attention and have the skill of dream interpretation. The group’s leader, a very wise dervish named Fariha Fatima al Jerrahi interprets their special meaning for the dreamer as well as the community. While Jason’s dream (__Step 22__) gave him career direction by leading to the formation of a successful company, other dreams can unveil guidance for different aspects of our lives. Whatever your current level of sensitivity and connectedness to the unseen world is, try to recognize the numerous directional sign posts that life puts along your path. The deeper you go, the more your goals will fall into alignment with the Master plan.\n\nRemember your Board of Advisors (__Step 4__)? Good mentors tend to bring everything back to your life purpose and inner journey. There is so much controversy and differences of opinion regarding spiritual philosophy. There are also a lot of pretenders and predators who don’t have either real knowledge or good intentions, but who prey off of others who are authentically eager and open to guidance. Follow your heart and intuition when it comes to aligning with any type of spiritual teacher or guide.\n\nToday, in building on the mentorship concept, I want to encourage you to consider what other types of support structures you have in your life. It’s not all about having a be-all, end-all mentor. Sometimes, having peers who are at or around your same level of understanding can be as helpful as having a mentor because those people are going through the same challenges as you are, and can relate. Ideally, you would have both – guidance from those who have walked in your shoes and moved further along the path, as well as those who are walking the walk, right by your side. Be it a formal support group, or informal group of friends, you really benefit from this type of support.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/1PqbSXMpbuQuKeOaKy2aoC/c134a00371a9ce39b62936457a387f8b/TimeBug-Icons-_Step-29_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"Spirituality Dreams","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"6tYIPU5sBySsIWOCcmswGA","type":"Asset","createdAt":"2018-09-13T17:15:04.217Z","updatedAt":"2018-09-13T20:22:55.000Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-29)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/6tYIPU5sBySsIWOCcmswGA/a42c918b51eb6fd2c6e0e08e280670c9/TimeBug-Icons-_Day-29_.svg","details":{"size":345240,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-29).svg","contentType":"image/svg+xml"}}},"snippet":"Connect with your larger spirituality master plan and align teachers and guides to help you achieve it.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/6sILgW14ZOQmSwk2CY0mOY/d13cc15d63f1a71aeecaa7cb462553f2/20-20-67-Phase-3-Step-29.mp3"},"assignments":[{"icon":null,"content":"Who are your spiritual “teammates” in 5 years from now? "},{"icon":null,"content":"What major goals (BHAGs) do you envision for yourself by year 5?\n\nHow will you prioritize your list items? (1= Low priority and 10= High priority)\n\nHow much time per week do you plan to spend on each spirituality BHAG and/or bucket list item per week?"},{"icon":null,"content":"Remember Step 10 (\"Mapping Out Your Internal World\")?\n\nHow will each of your listed Is (ego aspects) evolve by Year 5? \nWhat is each I saying in Year 5 that they it didn't now? "},{"icon":null,"content":"Who do you want to enjoy a major transformation or sense of peace and internal happiness in their lives? How will you help him/her? \n\nHow will you want help him/her attain those inner journey goals by Year 5?\n"},{"icon":null,"content":"How do you want to help further spirituality in the world 5 years from now?\n"}],"stepId":"29","workbookDurationMin":15},"30":{"number":30,"title":"Path to 20/20 = 8,760 Hours","subtitle":"Phase 3: Vision Creation","description":"Think back to __Step 2’s__ Lesson (Planting Seeds in Your Life Garden). Think about each hour you have spent on your 20/20 Life Vision as a seed – an idea – that can either grow and bear fruit or stagnate and die.\n\nYou will have 43,848 hours over 1,827 days over the next 5 years to evolve and manifest your dreams. The focus now is on building a detailed time and energy allocation plan for a one year – or 365 day – period, thinking in terms of hours (8,760 in a non-leap year). You can also do this exercise at any time during the year, choosing to A) either focus on the remaining days in a given year, or B) focus on a full year that doesn’t correspond exactly to the calendar year (i.e. April 2018 – March 2019). Every hour, every minute, every second counts.\n\nWith your dreams as guidance and inspiration (__Step 22__), it is now time to get specific. Make each grain count. __Step 2’s__ Ideal Week challenge is a good starting point to work with when envisioning a full year ahead.\n\nDuring __Step 10__, you were asked to map out your inner world. Again, I stress the importance of becoming the master or CEO of your internal world, which surely faces hundreds of competing demands. Everyone and everything wants your time and has promises or reasons for why you should spend more time with them. I am asking for some of it here, to participate in this program. Your family wants more of it. Your work and boss want more from you. Community service wants it. The Church wants it. It’s endless. You cannot make everyone totally happy. One of the benefits of this time allocation exercise is to wrestle with these competing demands and be firm about what your priorities are. Nothing speaks to your priorities more than how and where you invest your time and\nenergy.","refAssignment":[],"icon":{"uri":"https://images.ctfassets.net/6h184bey8vl3/5yfHQYGNHimuaokWicwCw6/7902ab097bf8a572a68c455b9edc8881/TimeBug-Icons-_Step-30_.svg"},"type":"VISION CREATION","color":"#00B896","duration":30,"stepScreenDescription":"The path to 20/20 vision","shortIcon":{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"6h184bey8vl3"}},"id":"5Kov1D3TDaAK2YmcAGY2O8","type":"Asset","createdAt":"2018-09-13T17:15:02.243Z","updatedAt":"2018-09-13T20:22:53.180Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"locale":"en-US"},"fields":{"title":"TimeBug-Icons-(Day-30)","file":{"url":"//images.ctfassets.net/6h184bey8vl3/5Kov1D3TDaAK2YmcAGY2O8/3aa1ea2b3cad741659af8bab9dc9debd/TimeBug-Icons-_Day-30_.svg","details":{"size":350375,"image":{"width":576,"height":576}},"fileName":"TimeBug-Icons-(Day-30).svg","contentType":"image/svg+xml"}}},"snippet":"Undergo a time allocation exercise that will force you to wrestle with competing demands. Set priorities about how and where you invest your time and energy.","audio":{"uri":"https://assets.ctfassets.net/6h184bey8vl3/5dSwcM8VAWIwaaCmGuq8Sk/cfb6da277fc41e36487cc86cee00f699/20-20-69-Phase-3-Step-30.mp3"},"checkin":{"text":"Congratultions on completing the 20/20 Life Vision Challenge! You've mapped out the next year of your life, hour to hour! That's quite an achievement. Check in daily, hold yourself accountable, and become the best you.","action":{"type":"link","payload":{"link":"journey/rewards?reward=30"}},"message":"With great discipline comes true freedom. Check in with your Life Vision daily, track your hours and enjoy the great things to come. ","frequency":"Daily"},"assignments":[{"icon":null,"content":"Map out the next year of your life - 8,760 hrs (365 days x 24 hrs) according to your Life Categories. Take a cue from Step 2 if needed and multiply by 52 to get your Annual Plan. \n\nComment on what you feel most excited about, in terms of what you can get done with that chunk of time. \n\nWhat do you most fear?\n\nSpirituality\nCore Work\nSpirituality\nPersonal Life\nHealth and Wellness\nBasic Needs\nSpecial Projects"}],"stepId":"30","workbookDurationMin":15}},"colors":{"steps":{"1":"#005587","2":"#005587","3":"#005587","4":"#005587","5":"#005587","6":"#005587","7":"#005587","8":"#005587","9":"#005587","10":"#005587","11":"#F78C00","12":"#F78C00","13":"#F78C00","14":"#F78C00","15":"#F78C00","16":"#F78C00","17":"#F78C00","18":"#F78C00","19":"#F78C00","20":"#F78C00","21":"#00B896","22":"#00B896","23":"#00B896","24":"#00B896","25":"#00B896","26":"#00B896","27":"#00B896","28":"#00B896","29":"#00B896","30":"#00B896"},"phases":{"COMPLETE":"#EB008B","MEDITATION":"#005587","SELF_ASSESSMENT":"#EB8900","VISION_CREATION":"#00B896"}},"pages":{"AppInstructions":{"title":"Not sure where to start?","content":"## What is this Challenge?\n\nThis Challenge will drive you to uncover your true purpose, nurture your gifts and create a more fulfilling life.\n\nEach step is geared for you to gain a new or refreshed and Life Plan. In each step you will be introduced to powerful tools, that will open up new channels of positive Energy and fueling your Life Vision.\n\n## What do I need to know to use it?\n\nThe journey is broken down into three phases – Discovery, Self-Assessment and Vision Creation – which are featured in two sections – the Guidebook and Workbook. \n\n\nYou can jump back and forth between the Guidebook and corresponding Workbook pages (which immediately follow each Step introduction) or read straight through the Guidebook pages and complete the Workbook exercises after.\n\nFocus on the finish line. You can always make changes along the way!"},"lifevisionapp.io content":{"title":"lifevisionapp.io","content":"# 20/20 Life Vision\n## A 30-Step Guide to Unveiling Your Higher Purpose\nThe 2020 Life Vision is packed with practical exercises for anyone seeking to discover, assess and create his or her ideal self! Each exercise focuses a different area of life, including health, relationships, career and finances and is accompanied by expert advice from leading industry professionals."},"2020lifevision content":{"title":"2020lifevision.com"}},"onboardingPages":{"intro":{"title":"Introduction To Life Vision","slides":[{"title":"Welcome to the 20/20 Life Vision Challenge!","description":"This is a 30 step challenge that will, if you let it, help orient your life towards your higher purpose. You're free to do the steps in any order you like, but we recommend starting from Step 1, \"The Rocking Chair\".","image":null},{"title":"Check in with your progress.","description":"As you move through the steps, you'll create daily, weekly and monthly check ins to help you stay on track.","image":null},{"title":"Pursue your goals without abandon!","description":"You'll also create goals as you move through the 30 step program. Life Vision goal tracking will allow you to create a step by step process for each of your goals, and you'll periodically update your progress. ","image":null}]}},"helpSlides":{"5":[{"title":"Do Something Else","description":"Lorem ipsum doler sit amet lorem ipsum doler sit amet.","order":1,"step":5,"image":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3sL6vc4uI0YaE2IWEiwscI/72a291d7bc083fdc6158c6839238e21a/160x300.png"}},{"title":"Do Something","description":"Lorem ipsum doler sit amet lorem ipsum doler sit amet.","order":0,"step":5,"image":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3sL6vc4uI0YaE2IWEiwscI/72a291d7bc083fdc6158c6839238e21a/160x300.png"}},{"title":"Do another thing","description":"Lorem ipsum doler sit amet lorem ipsum doler sit amet.","order":2,"step":5,"image":{"uri":"https://images.ctfassets.net/6h184bey8vl3/3sL6vc4uI0YaE2IWEiwscI/72a291d7bc083fdc6158c6839238e21a/160x300.png"}}]}}
